function setcity() {
    var SelP=document.getElementById(arguments[0]);
    var SelC=document.getElementById(arguments[1]);
    var SelA=document.getElementById(arguments[2]);
    var DefP=arguments[3];
    var DefC=arguments[4];
    var DefA=arguments[5];var provinceOptions = new Array("省",0,"北京",110000,"天津",120000,"河北省",130000,"山西省",140000,"内蒙古",150000,"辽宁省",210000,"吉林省",220000,"黑龙江省",230000,"上海",310000,"江苏省",320000,"浙江省",330000,"安徽省",340000,"福建省",350000,"江西省",360000,"山东省",370000,"河南省",410000,"湖北省",420000,"湖南省",430000,"广东省",440000,"广西",450000,"海南省",460000,"重庆",500000,"四川省",510000,"贵州省",520000,"云南省",530000,"西藏",540000,"陕西省",610000,"甘肃省",620000,"青海省",630000,"宁夏",640000,"新疆",650000 );
    SelP.options.length = 0;
    for(var i = 0; i < provinceOptions.length/2; i++) {
        SelP.options[i]=new Option(provinceOptions[i*2],provinceOptions[i*2+1]);
        if(SelP.options[i].value==DefP) {
            SelP.selectedIndex = i;
        }
    }

    SelP.onchange = function(){
        switch (SelP.value) {case "110000" :
var cityOptions = new Array("北京市",110100 );
 break;
case "120000" :
var cityOptions = new Array("天津市",820345 );
 break;
case "130000" :
var cityOptions = new Array("石家庄市",130100,"唐山市",130200,"秦皇岛市",130300,"邯郸市",130400,"邢台市",130500,"保定市",130600,"张家口市",130700,"承德市",130800,"沧州市",130900,"廊坊市",131000,"衡水市",131100 );
 break;
case "140000" :
var cityOptions = new Array("太原市",140100,"大同市",140200,"阳泉市",140300,"长治市",140400,"晋城市",140500,"朔州市",140600,"晋中市",140700,"运城市",140800,"忻州市",140900,"临汾市",141000,"吕梁市",141100 );
 break;
case "150000" :
var cityOptions = new Array("呼和浩特市",150100,"包头市",150200,"乌海市",150300,"赤峰市",150400,"通辽市",150500,"鄂尔多斯市",150600,"呼伦贝尔市",150700,"巴彦淖尔市",150800,"乌兰察布市",150900,"兴安盟",152200,"锡林郭勒盟",152500,"阿拉善盟",152900 );
 break;
case "210000" :
var cityOptions = new Array("沈阳市",210100,"大连市",210200,"鞍山市",210300,"抚顺市",210400,"本溪市",210500,"丹东市",210600,"锦州市",210700,"营口市",210800,"阜新市",210900,"辽阳市",211000,"盘锦市",211100,"铁岭市",211200,"朝阳市",211300,"葫芦岛市",211400 );
 break;
case "220000" :
var cityOptions = new Array("长春市",220100,"吉林市",220200,"四平市",220300,"辽源市",220400,"通化市",220500,"白山市",220600,"松原市",220700,"白城市",220800,"延边朝鲜族自治州",222400 );
 break;
case "230000" :
var cityOptions = new Array("哈尔滨市",230100,"齐齐哈尔市",230200,"鸡西市",230300,"鹤岗市",230400,"双鸭山市",230500,"大庆市",230600,"伊春市",230700,"佳木斯市",230800,"七台河市",230900,"牡丹江市",231000,"黑河市",231100,"绥化市",231200,"大兴安岭地区",232700 );
 break;
case "310000" :
var cityOptions = new Array("上海市",820303 );
 break;
case "320000" :
var cityOptions = new Array("南京市",320100,"无锡市",320200,"徐州市",320300,"常州市",320400,"苏州市",320500,"南通市",320600,"连云港市",320700,"淮安市",320800,"盐城市",320900,"扬州市",321000,"镇江市",321100,"泰州市",321200,"宿迁市",321300 );
 break;
case "330000" :
var cityOptions = new Array("杭州市",330100,"宁波市",330200,"温州市",330300,"嘉兴市",330400,"湖州市",330500,"绍兴市",330600,"金华市",330700,"衢州市",330800,"舟山市",330900,"台州市",331000,"丽水市",331100 );
 break;
case "340000" :
var cityOptions = new Array("合肥市",340100,"芜湖市",340200,"蚌埠市",340300,"淮南市",340400,"马鞍山市",340500,"淮北市",340600,"铜陵市",340700,"安庆市",340800,"黄山市",341000,"滁州市",341100,"阜阳市",341200,"宿州市",341300,"六安市",341500,"亳州市",341600,"池州市",341700,"宣城市",341800 );
 break;
case "350000" :
var cityOptions = new Array("福州市",350100,"厦门市",350200,"莆田市",350300,"三明市",350400,"泉州市",350500,"漳州市",350600,"南平市",350700,"龙岩市",350800,"宁德市",350900 );
 break;
case "360000" :
var cityOptions = new Array("南昌市",360100,"景德镇市",360200,"萍乡市",360300,"九江市",360400,"新余市",360500,"鹰潭市",360600,"赣州市",360700,"吉安市",360800,"宜春市",360900,"抚州市",361000,"上饶市",361100 );
 break;
case "370000" :
var cityOptions = new Array("济南市",370100,"青岛市",370200,"淄博市",370300,"枣庄市",370400,"东营市",370500,"烟台市",370600,"潍坊市",370700,"济宁市",370800,"泰安市",370900,"威海市",371000,"日照市",371100,"莱芜市",371200,"临沂市",371300,"德州市",371400,"聊城市",371500,"滨州市",371600,"菏泽市",371700 );
 break;
case "410000" :
var cityOptions = new Array("郑州市",410100,"开封市",410200,"洛阳市",410300,"平顶山市",410400,"安阳市",410500,"鹤壁市",410600,"新乡市",410700,"焦作市",410800,"濮阳市",410900,"许昌市",411000,"漯河市",411100,"三门峡市",411200,"南阳市",411300,"商丘市",411400,"信阳市",411500,"周口市",411600,"驻马店市",411700,"济源市",419000 );
 break;
case "420000" :
var cityOptions = new Array("武汉市",420100,"黄石市",420200,"十堰市",420300,"宜昌市",420500,"襄阳市",420600,"鄂州市",420700,"荆门市",420800,"孝感市",420900,"荆州市",421000,"黄冈市",421100,"咸宁市",421200,"随州市",421300,"恩施土家族苗族自治州",422800,"仙桃市",429000,"潜江市",820565,"天门市",820566,"神农架林区",820567 );
 break;
case "430000" :
var cityOptions = new Array("长沙市",430100,"株洲市",430200,"湘潭市",430300,"衡阳市",430400,"邵阳市",430500,"岳阳市",430600,"常德市",430700,"张家界市",430800,"益阳市",430900,"郴州市",431000,"永州市",431100,"怀化市",431200,"娄底市",431300,"湘西土家族苗族自治州",433100 );
 break;
case "440000" :
var cityOptions = new Array("广州市",440100,"韶关市",440200,"深圳市",440300,"珠海市",440400,"汕头市",440500,"佛山市",440600,"江门市",440700,"湛江市",440800,"茂名市",440900,"肇庆市",441200,"惠州市",441300,"梅州市",441400,"汕尾市",441500,"河源市",441600,"阳江市",441700,"清远市",441800,"东莞市",441900,"中山市",442000,"潮州市",445100,"揭阳市",445200,"云浮市",445300,"东沙群岛",820681 );
 break;
case "450000" :
var cityOptions = new Array("南宁市",450100,"柳州市",450200,"桂林市",450300,"梧州市",450400,"北海市",450500,"防城港市",450600,"钦州市",450700,"贵港市",450800,"玉林市",450900,"百色市",451000,"贺州市",451100,"河池市",451200,"来宾市",451300,"崇左市",451400 );
 break;
case "460000" :
var cityOptions = new Array("海口市",460100,"三亚市",460200,"三沙市",460300,"儋州市",460400,"五指山市",469000,"琼海市",820755,"文昌市",820756,"万宁市",820757,"东方市",820758,"定安县",820759,"屯昌县",820760,"澄迈县",820761,"临高县",820762,"白沙黎族自治县",820763,"昌江黎族自治县",820764,"乐东黎族自治县",820765,"陵水黎族自治县",820766,"保亭黎族苗族自治县",820767,"琼中黎族苗族自治县",820768 );
 break;
case "500000" :
var cityOptions = new Array("重庆市",500100 );
 break;
case "510000" :
var cityOptions = new Array("成都市",510100,"自贡市",510300,"攀枝花市",510400,"泸州市",510500,"德阳市",510600,"绵阳市",510700,"广元市",510800,"遂宁市",510900,"内江市",511000,"乐山市",511100,"南充市",511300,"眉山市",511400,"宜宾市",511500,"广安市",511600,"达州市",511700,"雅安市",511800,"巴中市",511900,"资阳市",512000,"阿坝藏族羌族自治州",513200,"甘孜藏族自治州",513300,"凉山彝族自治州",513400 );
 break;
case "520000" :
var cityOptions = new Array("贵阳市",520100,"六盘水市",520200,"遵义市",520300,"安顺市",520400,"毕节市",520500,"铜仁市",520600,"黔西南布依族苗族自治",522300,"黔东南苗族侗族自治州",522600,"黔南布依族苗族自治州",522700 );
 break;
case "530000" :
var cityOptions = new Array("昆明市",530100,"曲靖市",530300,"玉溪市",530400,"保山市",530500,"昭通市",530600,"丽江市",530700,"普洱市",530800,"临沧市",530900,"楚雄彝族自治州",532300,"红河哈尼族彝族自治州",532500,"文山壮族苗族自治州",532600,"西双版纳傣族自治州",532800,"大理白族自治州",532900,"德宏傣族景颇族自治州",533100,"怒江傈僳族自治州",533300,"迪庆藏族自治州",533400 );
 break;
case "540000" :
var cityOptions = new Array("拉萨市",540100,"日喀则市",540200,"昌都市",540300,"林芝市",540400,"山南地区",542200,"那曲地区",542400,"阿里地区",542500 );
 break;
case "610000" :
var cityOptions = new Array("西安市",610100,"铜川市",610200,"宝鸡市",610300,"咸阳市",610400,"渭南市",610500,"延安市",610600,"汉中市",610700,"榆林市",610800,"安康市",610900,"商洛市",611000 );
 break;
case "620000" :
var cityOptions = new Array("兰州市",620100,"嘉峪关市",620200,"金昌市",620300,"白银市",620400,"天水市",620500,"武威市",620600,"张掖市",620700,"平凉市",620800,"酒泉市",620900,"庆阳市",621000,"定西市",621100,"陇南市",621200,"临夏回族自治州",622900,"甘南藏族自治州",623000 );
 break;
case "630000" :
var cityOptions = new Array("西宁市",630100,"海东市",630200,"海北藏族自治州",632200,"黄南藏族自治州",632300,"海南藏族自治州",632500,"果洛藏族自治州",632600,"玉树藏族自治州",632700,"海西蒙古族藏族自治州",632800 );
 break;
case "640000" :
var cityOptions = new Array("银川市",640100,"石嘴山市",640200,"吴忠市",640300,"固原市",640400,"中卫市",640500 );
 break;
case "650000" :
var cityOptions = new Array("乌鲁木齐市",650100,"克拉玛依市",650200,"吐鲁番市",650400,"哈密地区",652200,"昌吉回族自治州",652300,"博尔塔拉蒙古自治州",652700,"巴音郭楞蒙古自治州",652800,"阿克苏地区",652900,"克孜勒苏柯尔克孜自治",653000,"喀什地区",653100,"和田地区",653200,"伊犁哈萨克自治州",654000,"塔城地区",654200,"阿勒泰地区",654300,"可克达拉市",659000,"石河子市",821212,"阿拉尔市",821213,"图木舒克市",821214,"五家渠市",821215 );
 break;
        default:
            var cityOptions = new Array("");
            break;
        }

        SelC.options.length = 0;
        SelA.options.length = 0;
        for(var i = 0; i < cityOptions.length/2; i++) {
            SelC.options[i]=new Option(cityOptions[i*2],cityOptions[i*2+1]);
            if (SelC.options[i].value==DefC) {
                SelC.selectedIndex = i;
            }
        }
        SelC.onchange();
    }
        SelC.onchange = function(){
        switch (SelC.value) {case "110100" :
var areaOptions = new Array("东城区",110101,"西城区",110102,"朝阳区",110105,"丰台区",110106,"石景山区",110107,"海淀区",110108,"门头沟区",110109,"房山区",110111,"通州区",110112,"顺义区",110113,"昌平区",110114,"大兴区",110115,"怀柔区",110116,"平谷区",110117,"崇文区",820302,"宣武区",820341,"密云县",820342,"延庆县",820343,"其它区",820344 );
 break;
case "820345" :
var areaOptions = new Array("和平区",820346,"河东区",820347,"河西区",820348,"南开区",820349,"河北区",820350,"红桥区",820351,"塘沽区",820352,"汉沽区",820353,"大港区",820354,"东丽区",820355,"西青区",820356,"津南区",820357,"北辰区",820358,"武清区",820359,"宝坻区",820360,"滨海新区",820361,"宁河县",820362,"静海县",820363,"蓟县",820364,"其它区",820365 );
 break;
case "130100" :
var areaOptions = new Array("长安区",130102,"桥西区",130104,"新华区",130105,"井陉矿区",130107,"裕华区",130108,"藁城区",130109,"鹿泉区",130110,"栾城区",130111,"井陉县",130121,"正定县",130123,"行唐县",130125,"灵寿县",130126,"高邑县",130127,"深泽县",130128,"赞皇县",130129,"无极县",130130,"平山县",130131,"元氏县",130132,"赵县",130133,"辛集市",130181,"晋州市",130183,"新乐市",130184,"其它区",820387,"桥东区",820937 );
 break;
case "130200" :
var areaOptions = new Array("路南区",130202,"路北区",130203,"古冶区",130204,"开平区",130205,"丰南区",130207,"丰润区",130208,"曹妃甸区",130209,"滦县",130223,"滦南县",130224,"乐亭县",130225,"迁西县",130227,"玉田县",130229,"遵化市",130281,"迁安市",130283,"其它区",820307 );
 break;
case "130300" :
var areaOptions = new Array("海港区",130302,"山海关区",130303,"北戴河区",130304,"青龙满族自治县",130321,"昌黎县",130322,"抚宁县",130323,"卢龙县",130324,"其它区",820388,"经济技术开发区",820938 );
 break;
case "130400" :
var areaOptions = new Array("邯山区",130402,"丛台区",130403,"复兴区",130404,"峰峰矿区",130406,"邯郸县",130421,"临漳县",130423,"成安县",130424,"大名县",130425,"涉县",130426,"磁县",130427,"肥乡县",130428,"永年县",130429,"邱县",130430,"鸡泽县",130431,"广平县",130432,"馆陶县",130433,"魏县",130434,"曲周县",130435,"武安市",130481,"其它区",820389 );
 break;
case "130500" :
var areaOptions = new Array("桥东区",130502,"桥西区",130503,"邢台县",130521,"临城县",130522,"内丘县",130523,"柏乡县",130524,"隆尧县",130525,"任县",130526,"南和县",130527,"宁晋县",130528,"巨鹿县",130529,"新河县",130530,"广宗县",130531,"平乡县",130532,"威县",130533,"清河县",130534,"临西县",130535,"南宫市",130581,"沙河市",130582,"其它区",820390 );
 break;
case "130600" :
var areaOptions = new Array("新市区",130602,"北市区",130603,"南市区",130604,"满城县",130621,"清苑县",130622,"涞水县",130623,"阜平县",130624,"徐水县",130625,"定兴县",130626,"唐县",130627,"高阳县",130628,"容城县",130629,"涞源县",130630,"望都县",130631,"安新县",130632,"易县",130633,"曲阳县",130634,"蠡县",130635,"顺平县",130636,"博野县",130637,"雄县",130638,"涿州市",130681,"定州市",130682,"安国市",130683,"高碑店市",130684,"其它区",820391,"高开区",820939 );
 break;
case "130700" :
var areaOptions = new Array("桥东区",130702,"桥西区",130703,"宣化区",130705,"下花园区",130706,"宣化县",130721,"张北县",130722,"康保县",130723,"沽源县",130724,"尚义县",130725,"蔚县",130726,"阳原县",130727,"怀安县",130728,"万全县",130729,"怀来县",130730,"涿鹿县",130731,"赤城县",130732,"崇礼县",130733,"其它区",820392 );
 break;
case "130800" :
var areaOptions = new Array("双桥区",130802,"双滦区",130803,"鹰手营子矿区",130804,"承德县",130821,"兴隆县",130822,"平泉县",130823,"滦平县",130824,"隆化县",130825,"丰宁满族自治县",130826,"宽城满族自治县",130827,"围场满族蒙古族自治县",130828,"其它区",820393 );
 break;
case "130900" :
var areaOptions = new Array("新华区",130902,"运河区",130903,"沧县",130921,"青县",130922,"东光县",130923,"海兴县",130924,"盐山县",130925,"肃宁县",130926,"南皮县",130927,"吴桥县",130928,"献县",130929,"孟村回族自治县",130930,"泊头市",130981,"任丘市",130982,"黄骅市",130983,"河间市",130984,"其它区",820394 );
 break;
case "131000" :
var areaOptions = new Array("安次区",131002,"广阳区",131003,"固安县",131022,"永清县",131023,"香河县",131024,"大城县",131025,"文安县",131026,"大厂回族自治县",131028,"霸州市",131081,"三河市",131082,"其它区",820395,"开发区",820940,"燕郊经济技术开发区",820941 );
 break;
case "131100" :
var areaOptions = new Array("桃城区",131102,"枣强县",131121,"武邑县",131122,"武强县",131123,"饶阳县",131124,"安平县",131125,"故城县",131126,"景县",131127,"阜城县",131128,"冀州市",131181,"深州市",131182,"其它区",820396 );
 break;
case "140100" :
var areaOptions = new Array("小店区",140105,"迎泽区",140106,"杏花岭区",140107,"尖草坪区",140108,"万柏林区",140109,"晋源区",140110,"清徐县",140121,"阳曲县",140122,"娄烦县",140123,"古交市",140181,"其它区",820397 );
 break;
case "140200" :
var areaOptions = new Array("城区",140202,"矿区",140203,"南郊区",140211,"新荣区",140212,"阳高县",140221,"天镇县",140222,"广灵县",140223,"灵丘县",140224,"浑源县",140225,"左云县",140226,"大同县",140227,"其它区",820386 );
 break;
case "140300" :
var areaOptions = new Array("城区",140302,"矿区",140303,"郊区",140311,"平定县",140321,"盂县",140322,"其它区",820398 );
 break;
case "140400" :
var areaOptions = new Array("城区",140402,"郊区",140411,"长治县",140421,"襄垣县",140423,"屯留县",140424,"平顺县",140425,"黎城县",140426,"壶关县",140427,"长子县",140428,"武乡县",140429,"沁县",140430,"沁源县",140431,"潞城市",140481,"其它区",820399,"高新区",820942 );
 break;
case "140500" :
var areaOptions = new Array("城区",140502,"沁水县",140521,"阳城县",140522,"陵川县",140524,"泽州县",140525,"高平市",140581,"其它区",820400 );
 break;
case "140600" :
var areaOptions = new Array("朔城区",140602,"平鲁区",140603,"山阴县",140621,"应县",140622,"右玉县",140623,"怀仁县",140624,"其它区",820401 );
 break;
case "140700" :
var areaOptions = new Array("榆次区",140702,"榆社县",140721,"左权县",140722,"和顺县",140723,"昔阳县",140724,"寿阳县",140725,"太谷县",140726,"祁县",140727,"平遥县",140728,"灵石县",140729,"介休市",140781,"其它区",820402 );
 break;
case "140800" :
var areaOptions = new Array("盐湖区",140802,"临猗县",140821,"万荣县",140822,"闻喜县",140823,"稷山县",140824,"新绛县",140825,"绛县",140826,"垣曲县",140827,"夏县",140828,"平陆县",140829,"芮城县",140830,"永济市",140881,"河津市",140882,"其它区",820403 );
 break;
case "140900" :
var areaOptions = new Array("忻府区",140902,"定襄县",140921,"五台县",140922,"代县",140923,"繁峙县",140924,"宁武县",140925,"静乐县",140926,"神池县",140927,"五寨县",140928,"岢岚县",140929,"河曲县",140930,"保德县",140931,"偏关县",140932,"原平市",140981,"其它区",820404 );
 break;
case "141000" :
var areaOptions = new Array("尧都区",141002,"曲沃县",141021,"翼城县",141022,"襄汾县",141023,"洪洞县",141024,"古县",141025,"安泽县",141026,"浮山县",141027,"吉县",141028,"乡宁县",141029,"大宁县",141030,"隰县",141031,"永和县",141032,"蒲县",141033,"汾西县",141034,"侯马市",141081,"霍州市",141082,"其它区",820405 );
 break;
case "141100" :
var areaOptions = new Array("离石区",141102,"文水县",141121,"交城县",141122,"兴县",141123,"临县",141124,"柳林县",141125,"石楼县",141126,"岚县",141127,"方山县",141128,"中阳县",141129,"交口县",141130,"孝义市",141181,"汾阳市",141182,"其它区",820406 );
 break;
case "150100" :
var areaOptions = new Array("新城区",150102,"回民区",150103,"玉泉区",150104,"赛罕区",150105,"土默特左旗",150121,"托克托县",150122,"和林格尔县",150123,"清水河县",150124,"武川县",150125,"其它区",820407 );
 break;
case "150200" :
var areaOptions = new Array("东河区",150202,"昆都仑区",150203,"青山区",150204,"石拐区",150205,"白云鄂博矿区",150206,"九原区",150207,"土默特右旗",150221,"固阳县",150222,"达尔罕茂明安联合旗",150223,"其它区",820408 );
 break;
case "150300" :
var areaOptions = new Array("海勃湾区",150302,"海南区",150303,"乌达区",150304,"其它区",820409 );
 break;
case "150400" :
var areaOptions = new Array("红山区",150402,"元宝山区",150403,"松山区",150404,"阿鲁科尔沁旗",150421,"巴林左旗",150422,"巴林右旗",150423,"林西县",150424,"克什克腾旗",150425,"翁牛特旗",150426,"喀喇沁旗",150428,"宁城县",150429,"敖汉旗",150430,"其它区",820410 );
 break;
case "150500" :
var areaOptions = new Array("科尔沁区",150502,"科尔沁左翼中旗",150521,"科尔沁左翼后旗",150522,"开鲁县",150523,"库伦旗",150524,"奈曼旗",150525,"扎鲁特旗",150526,"霍林郭勒市",150581,"其它区",820411 );
 break;
case "150600" :
var areaOptions = new Array("东胜区",150602,"达拉特旗",150621,"准格尔旗",150622,"鄂托克前旗",150623,"鄂托克旗",150624,"杭锦旗",150625,"乌审旗",150626,"伊金霍洛旗",150627,"其它区",820412 );
 break;
case "150700" :
var areaOptions = new Array("海拉尔区",150702,"扎赉诺尔区",150703,"阿荣旗",150721,"莫力达瓦达斡尔族自治",150722,"鄂伦春自治旗",150723,"鄂温克族自治旗",150724,"陈巴尔虎旗",150725,"新巴尔虎左旗",150726,"新巴尔虎右旗",150727,"满洲里市",150781,"牙克石市",150782,"扎兰屯市",150783,"额尔古纳市",150784,"根河市",150785,"其它区",820413 );
 break;
case "150800" :
var areaOptions = new Array("临河区",150802,"五原县",150821,"磴口县",150822,"乌拉特前旗",150823,"乌拉特中旗",150824,"乌拉特后旗",150825,"杭锦后旗",150826,"其它区",820414 );
 break;
case "150900" :
var areaOptions = new Array("集宁区",150902,"卓资县",150921,"化德县",150922,"商都县",150923,"兴和县",150924,"凉城县",150925,"察哈尔右翼前旗",150926,"察哈尔右翼中旗",150927,"察哈尔右翼后旗",150928,"四子王旗",150929,"丰镇市",150981,"其它区",820415 );
 break;
case "152200" :
var areaOptions = new Array("乌兰浩特市",152201,"阿尔山市",152202,"科尔沁右翼前旗",152221,"科尔沁右翼中旗",152222,"扎赉特旗",152223,"突泉县",152224,"其它区",820416 );
 break;
case "152500" :
var areaOptions = new Array("二连浩特市",152501,"锡林浩特市",152502,"阿巴嘎旗",152522,"苏尼特左旗",152523,"苏尼特右旗",152524,"东乌珠穆沁旗",152525,"西乌珠穆沁旗",152526,"太仆寺旗",152527,"镶黄旗",152528,"正镶白旗",152529,"正蓝旗",152530,"多伦县",152531,"其它区",820417 );
 break;
case "152900" :
var areaOptions = new Array("阿拉善左旗",152921,"阿拉善右旗",152922,"额济纳旗",152923,"其它区",820418 );
 break;
case "210100" :
var areaOptions = new Array("和平区",210102,"沈河区",210103,"大东区",210104,"皇姑区",210105,"铁西区",210106,"苏家屯区",210111,"浑南区",210112,"沈北新区",210113,"于洪区",210114,"辽中县",210122,"康平县",210123,"法库县",210124,"新民市",210181,"其它区",820419,"新城子区",820943,"张士开发区",820944,"浑南新区",820945 );
 break;
case "210200" :
var areaOptions = new Array("中山区",210202,"西岗区",210203,"沙河口区",210204,"甘井子区",210211,"旅顺口区",210212,"金州区",210213,"长海县",210224,"瓦房店市",210281,"普兰店市",210282,"庄河市",210283,"其它区",820420,"开发区",820946,"岭前区",820947 );
 break;
case "210300" :
var areaOptions = new Array("铁东区",210302,"铁西区",210303,"立山区",210304,"千山区",210311,"台安县",210321,"岫岩满族自治县",210323,"海城市",210381,"其它区",820421,"高新区",820948 );
 break;
case "210400" :
var areaOptions = new Array("新抚区",210402,"东洲区",210403,"望花区",210404,"顺城区",210411,"抚顺县",210421,"新宾满族自治县",210422,"清原满族自治县",210423,"其它区",820422 );
 break;
case "210500" :
var areaOptions = new Array("平山区",210502,"溪湖区",210503,"明山区",210504,"南芬区",210505,"本溪满族自治县",210521,"桓仁满族自治县",210522,"其它区",820423 );
 break;
case "210600" :
var areaOptions = new Array("元宝区",210602,"振兴区",210603,"振安区",210604,"宽甸满族自治县",210624,"东港市",210681,"凤城市",210682,"其它区",820424 );
 break;
case "210700" :
var areaOptions = new Array("古塔区",210702,"凌河区",210703,"太和区",210711,"黑山县",210726,"义县",210727,"凌海市",210781,"北镇市",210782,"其它区",820425 );
 break;
case "210800" :
var areaOptions = new Array("站前区",210802,"西市区",210803,"鲅鱼圈区",210804,"老边区",210811,"盖州市",210881,"大石桥市",210882,"其它区",820426 );
 break;
case "210900" :
var areaOptions = new Array("海州区",210902,"新邱区",210903,"太平区",210904,"清河门区",210905,"细河区",210911,"阜新蒙古族自治县",210921,"彰武县",210922,"其它区",820427 );
 break;
case "211000" :
var areaOptions = new Array("白塔区",211002,"文圣区",211003,"宏伟区",211004,"弓长岭区",211005,"太子河区",211011,"辽阳县",211021,"灯塔市",211081,"其它区",820428 );
 break;
case "211100" :
var areaOptions = new Array("双台子区",211102,"兴隆台区",211103,"大洼县",211121,"盘山县",211122,"其它区",820429 );
 break;
case "211200" :
var areaOptions = new Array("银州区",211202,"清河区",211204,"铁岭县",211221,"西丰县",211223,"昌图县",211224,"调兵山市",211281,"开原市",211282,"其它区",820430 );
 break;
case "211300" :
var areaOptions = new Array("双塔区",211302,"龙城区",211303,"朝阳县",211321,"建平县",211322,"喀喇沁左翼蒙古族自治",211324,"北票市",211381,"凌源市",211382,"其它区",820431 );
 break;
case "211400" :
var areaOptions = new Array("连山区",211402,"龙港区",211403,"南票区",211404,"绥中县",211421,"建昌县",211422,"兴城市",211481,"其它区",820432 );
 break;
case "220100" :
var areaOptions = new Array("南关区",220102,"宽城区",220103,"朝阳区",220104,"二道区",220105,"绿园区",220106,"双阳区",220112,"九台区",220113,"农安县",220122,"榆树市",220182,"德惠市",220183,"其它区",820433,"高新技术产业开发区",820949,"汽车产业开发区",820950,"经济技术开发区",820951,"净月旅游开发区",820952 );
 break;
case "220200" :
var areaOptions = new Array("昌邑区",220202,"龙潭区",220203,"船营区",220204,"丰满区",220211,"永吉县",220221,"蛟河市",220281,"桦甸市",220282,"舒兰市",220283,"磐石市",220284,"其它区",820434 );
 break;
case "220300" :
var areaOptions = new Array("铁西区",220302,"铁东区",220303,"梨树县",220322,"伊通满族自治县",220323,"公主岭市",220381,"双辽市",220382,"其它区",820435 );
 break;
case "220400" :
var areaOptions = new Array("龙山区",220402,"西安区",220403,"东丰县",220421,"东辽县",220422,"其它区",820436 );
 break;
case "220500" :
var areaOptions = new Array("东昌区",220502,"二道江区",220503,"通化县",220521,"辉南县",220523,"柳河县",220524,"梅河口市",220581,"集安市",220582,"其它区",820437 );
 break;
case "220600" :
var areaOptions = new Array("浑江区",220602,"江源区",220605,"抚松县",220621,"靖宇县",220622,"长白朝鲜族自治县",220623,"临江市",220681,"其它区",820438 );
 break;
case "220700" :
var areaOptions = new Array("宁江区",220702,"前郭尔罗斯蒙古族自治",220721,"长岭县",220722,"乾安县",220723,"扶余市",220781,"其它区",820439 );
 break;
case "220800" :
var areaOptions = new Array("洮北区",220802,"镇赉县",220821,"通榆县",220822,"洮南市",220881,"大安市",220882,"其它区",820440 );
 break;
case "222400" :
var areaOptions = new Array("延吉市",222401,"图们市",222402,"敦化市",222403,"珲春市",222404,"龙井市",222405,"和龙市",222406,"汪清县",222424,"安图县",222426,"其它区",820441 );
 break;
case "230100" :
var areaOptions = new Array("道里区",230102,"南岗区",230103,"道外区",230104,"平房区",230108,"松北区",230109,"香坊区",230110,"呼兰区",230111,"阿城区",230112,"双城区",230113,"依兰县",230123,"方正县",230124,"宾县",230125,"巴彦县",230126,"木兰县",230127,"通河县",230128,"延寿县",230129,"尚志市",230183,"五常市",230184,"其它区",820442,"动力区",820953,"阿城市",820954 );
 break;
case "230200" :
var areaOptions = new Array("龙沙区",230202,"建华区",230203,"铁锋区",230204,"昂昂溪区",230205,"富拉尔基区",230206,"碾子山区",230207,"梅里斯达斡尔族区",230208,"龙江县",230221,"依安县",230223,"泰来县",230224,"甘南县",230225,"富裕县",230227,"克山县",230229,"克东县",230230,"拜泉县",230231,"讷河市",230281,"其它区",820443 );
 break;
case "230300" :
var areaOptions = new Array("鸡冠区",230302,"恒山区",230303,"滴道区",230304,"梨树区",230305,"城子河区",230306,"麻山区",230307,"鸡东县",230321,"虎林市",230381,"密山市",230382,"其它区",820444 );
 break;
case "230400" :
var areaOptions = new Array("向阳区",230402,"工农区",230403,"南山区",230404,"兴安区",230405,"东山区",230406,"兴山区",230407,"萝北县",230421,"绥滨县",230422,"其它区",820445 );
 break;
case "230500" :
var areaOptions = new Array("尖山区",230502,"岭东区",230503,"四方台区",230505,"宝山区",230506,"集贤县",230521,"友谊县",230522,"宝清县",230523,"饶河县",230524,"其它区",820446 );
 break;
case "230600" :
var areaOptions = new Array("萨尔图区",230602,"龙凤区",230603,"让胡路区",230604,"红岗区",230605,"大同区",230606,"肇州县",230621,"肇源县",230622,"林甸县",230623,"杜尔伯特蒙古族自治县",230624,"其它区",820447 );
 break;
case "230700" :
var areaOptions = new Array("伊春区",230702,"南岔区",230703,"友好区",230704,"西林区",230705,"翠峦区",230706,"新青区",230707,"美溪区",230708,"金山屯区",230709,"五营区",230710,"乌马河区",230711,"汤旺河区",230712,"带岭区",230713,"乌伊岭区",230714,"红星区",230715,"上甘岭区",230716,"嘉荫县",230722,"铁力市",230781,"其它区",820448 );
 break;
case "230800" :
var areaOptions = new Array("向阳区",230803,"前进区",230804,"东风区",230805,"郊区",230811,"桦南县",230822,"桦川县",230826,"汤原县",230828,"抚远县",230833,"同江市",230881,"富锦市",230882,"其它区",820449,"永红区",820955 );
 break;
case "230900" :
var areaOptions = new Array("新兴区",230902,"桃山区",230903,"茄子河区",230904,"勃利县",230921,"其它区",820450 );
 break;
case "231000" :
var areaOptions = new Array("东安区",231002,"阳明区",231003,"爱民区",231004,"西安区",231005,"东宁县",231024,"林口县",231025,"绥芬河市",231081,"海林市",231083,"宁安市",231084,"穆棱市",231085,"其它区",820451 );
 break;
case "231100" :
var areaOptions = new Array("爱辉区",231102,"嫩江县",231121,"逊克县",231123,"孙吴县",231124,"北安市",231181,"五大连池市",231182,"其它区",820452 );
 break;
case "231200" :
var areaOptions = new Array("北林区",231202,"望奎县",231221,"兰西县",231222,"青冈县",231223,"庆安县",231224,"明水县",231225,"绥棱县",231226,"安达市",231281,"肇东市",231282,"海伦市",231283,"其它区",820453 );
 break;
case "232700" :
var areaOptions = new Array("呼玛县",232721,"塔河县",232722,"漠河县",232723,"其它区",820454,"松岭区",820956,"新林区",820957,"呼中区",820958,"加格达奇区",820959 );
 break;
case "820303" :
var areaOptions = new Array("黄浦区",820304,"卢湾区",820366,"徐汇区",820367,"长宁区",820368,"静安区",820369,"普陀区",820370,"闸北区",820371,"虹口区",820372,"杨浦区",820373,"闵行区",820374,"宝山区",820375,"嘉定区",820376,"浦东新区",820377,"金山区",820378,"松江区",820379,"青浦区",820380,"南汇区",820381,"奉贤区",820382,"川沙区",820383,"崇明县",820384,"其它区",820385 );
 break;
case "320100" :
var areaOptions = new Array("玄武区",320102,"秦淮区",320104,"建邺区",320105,"鼓楼区",320106,"浦口区",320111,"栖霞区",320113,"雨花台区",320114,"江宁区",320115,"六合区",320116,"溧水区",320117,"高淳区",320118,"其它区",820455,"白下区",820935,"下关区",820936 );
 break;
case "320200" :
var areaOptions = new Array("崇安区",320202,"南长区",320203,"北塘区",320204,"锡山区",320205,"惠山区",320206,"滨湖区",320211,"江阴市",320281,"宜兴市",320282,"其它区",820456,"梁溪区",820960,"新吴区",820961,"新区",820962 );
 break;
case "320300" :
var areaOptions = new Array("鼓楼区",320302,"云龙区",320303,"贾汪区",320305,"泉山区",320311,"铜山区",320312,"丰县",320321,"沛县",320322,"睢宁县",320324,"新沂市",320381,"邳州市",320382,"其它区",820457,"九里区",820963 );
 break;
case "320400" :
var areaOptions = new Array("天宁区",320402,"钟楼区",320404,"戚墅堰区",320405,"新北区",320411,"武进区",320412,"溧阳市",320481,"金坛市",320482,"其它区",820458 );
 break;
case "320500" :
var areaOptions = new Array("虎丘区",320505,"吴中区",320506,"相城区",320507,"姑苏区",320508,"吴江区",320509,"常熟市",320581,"张家港市",320582,"昆山市",320583,"太仓市",320585,"其它区",820459,"沧浪区",820964,"平江区",820965,"金阊区",820966,"新区",820967,"园区",820968 );
 break;
case "320600" :
var areaOptions = new Array("崇川区",320602,"港闸区",320611,"通州区",320612,"海安县",320621,"如东县",320623,"启东市",320681,"如皋市",320682,"海门市",320684,"其它区",820460,"通州市",820969,"开发区",820970 );
 break;
case "320700" :
var areaOptions = new Array("连云区",320703,"海州区",320706,"赣榆区",320707,"东海县",320722,"灌云县",320723,"灌南县",320724,"其它区",820461,"新浦区",820971 );
 break;
case "320800" :
var areaOptions = new Array("清河区",320802,"淮安区",320803,"淮阴区",320804,"清浦区",320811,"涟水县",320826,"洪泽县",320829,"盱眙县",320830,"金湖县",320831,"其它区",820462 );
 break;
case "320900" :
var areaOptions = new Array("亭湖区",320902,"盐都区",320903,"响水县",320921,"滨海县",320922,"阜宁县",320923,"射阳县",320924,"建湖县",320925,"东台市",320981,"大丰市",320982,"其它区",820463 );
 break;
case "321000" :
var areaOptions = new Array("广陵区",321002,"邗江区",321003,"江都区",321012,"宝应县",321023,"仪征市",321081,"高邮市",321084,"其它区",820464,"维扬区",820972,"经济开发区",820973 );
 break;
case "321100" :
var areaOptions = new Array("京口区",321102,"润州区",321111,"丹徒区",321112,"丹阳市",321181,"扬中市",321182,"句容市",321183,"其它区",820465 );
 break;
case "321200" :
var areaOptions = new Array("海陵区",321202,"高港区",321203,"姜堰区",321204,"兴化市",321281,"靖江市",321282,"泰兴市",321283,"其它区",820466 );
 break;
case "321300" :
var areaOptions = new Array("宿城区",321302,"宿豫区",321311,"沭阳县",321322,"泗阳县",321323,"泗洪县",321324,"其它区",820467 );
 break;
case "330100" :
var areaOptions = new Array("上城区",330102,"下城区",330103,"江干区",330104,"拱墅区",330105,"西湖区",330106,"滨江区",330108,"萧山区",330109,"余杭区",330110,"富阳区",330111,"桐庐县",330122,"淳安县",330127,"建德市",330182,"临安市",330185,"其它区",820468 );
 break;
case "330200" :
var areaOptions = new Array("海曙区",330203,"江东区",330204,"江北区",330205,"北仑区",330206,"镇海区",330211,"鄞州区",330212,"象山县",330225,"宁海县",330226,"余姚市",330281,"慈溪市",330282,"奉化市",330283,"其它区",820469 );
 break;
case "330300" :
var areaOptions = new Array("鹿城区",330302,"龙湾区",330303,"瓯海区",330304,"洞头县",330322,"永嘉县",330324,"平阳县",330326,"苍南县",330327,"文成县",330328,"泰顺县",330329,"瑞安市",330381,"乐清市",330382,"其它区",820470 );
 break;
case "330400" :
var areaOptions = new Array("南湖区",330402,"秀洲区",330411,"嘉善县",330421,"海盐县",330424,"海宁市",330481,"平湖市",330482,"桐乡市",330483,"其它区",820471 );
 break;
case "330500" :
var areaOptions = new Array("吴兴区",330502,"南浔区",330503,"德清县",330521,"长兴县",330522,"安吉县",330523,"其它区",820472 );
 break;
case "330600" :
var areaOptions = new Array("越城区",330602,"柯桥区",330603,"上虞区",330604,"新昌县",330624,"诸暨市",330681,"嵊州市",330683,"其它区",820473 );
 break;
case "330700" :
var areaOptions = new Array("婺城区",330702,"金东区",330703,"武义县",330723,"浦江县",330726,"磐安县",330727,"兰溪市",330781,"义乌市",330782,"东阳市",330783,"永康市",330784,"其它区",820474 );
 break;
case "330800" :
var areaOptions = new Array("柯城区",330802,"衢江区",330803,"常山县",330822,"开化县",330824,"龙游县",330825,"江山市",330881,"其它区",820475 );
 break;
case "330900" :
var areaOptions = new Array("定海区",330902,"普陀区",330903,"岱山县",330921,"嵊泗县",330922,"其它区",820476 );
 break;
case "331000" :
var areaOptions = new Array("椒江区",331002,"黄岩区",331003,"路桥区",331004,"玉环县",331021,"三门县",331022,"天台县",331023,"仙居县",331024,"温岭市",331081,"临海市",331082,"其它区",820477 );
 break;
case "331100" :
var areaOptions = new Array("莲都区",331102,"青田县",331121,"缙云县",331122,"遂昌县",331123,"松阳县",331124,"云和县",331125,"庆元县",331126,"景宁畲族自治县",331127,"龙泉市",331181,"其它区",820478 );
 break;
case "340100" :
var areaOptions = new Array("瑶海区",340102,"庐阳区",340103,"蜀山区",340104,"包河区",340111,"长丰县",340121,"肥东县",340122,"肥西县",340123,"庐江县",340124,"巢湖市",340181,"其它区",820479,"高新区",820974,"中区",820975,"居巢区",820976 );
 break;
case "340200" :
var areaOptions = new Array("镜湖区",340202,"弋江区",340203,"鸠江区",340207,"三山区",340208,"芜湖县",340221,"繁昌县",340222,"南陵县",340223,"无为县",340225,"其它区",820480 );
 break;
case "340300" :
var areaOptions = new Array("龙子湖区",340302,"蚌山区",340303,"禹会区",340304,"淮上区",340311,"怀远县",340321,"五河县",340322,"固镇县",340323,"其它区",820481 );
 break;
case "340400" :
var areaOptions = new Array("大通区",340402,"田家庵区",340403,"谢家集区",340404,"八公山区",340405,"潘集区",340406,"凤台县",340421,"其它区",820482,"寿县",820977 );
 break;
case "340500" :
var areaOptions = new Array("花山区",340503,"雨山区",340504,"博望区",340506,"当涂县",340521,"含山县",340522,"和县",340523,"其它区",820483,"金家庄区",820978 );
 break;
case "340600" :
var areaOptions = new Array("杜集区",340602,"相山区",340603,"烈山区",340604,"濉溪县",340621,"其它区",820484 );
 break;
case "340700" :
var areaOptions = new Array("铜官山区",340702,"狮子山区",340703,"郊区",340711,"铜陵县",340721,"其它区",820485,"铜官区",820979,"枞阳县",820980 );
 break;
case "340800" :
var areaOptions = new Array("迎江区",340802,"大观区",340803,"宜秀区",340811,"怀宁县",340822,"枞阳县",340823,"潜山县",340824,"太湖县",340825,"宿松县",340826,"望江县",340827,"岳西县",340828,"桐城市",340881,"其它区",820486 );
 break;
case "341000" :
var areaOptions = new Array("屯溪区",341002,"黄山区",341003,"徽州区",341004,"歙县",341021,"休宁县",341022,"黟县",341023,"祁门县",341024,"其它区",820487 );
 break;
case "341100" :
var areaOptions = new Array("琅琊区",341102,"南谯区",341103,"来安县",341122,"全椒县",341124,"定远县",341125,"凤阳县",341126,"天长市",341181,"明光市",341182,"其它区",820488 );
 break;
case "341200" :
var areaOptions = new Array("颍州区",341202,"颍东区",341203,"颍泉区",341204,"临泉县",341221,"太和县",341222,"阜南县",341225,"颍上县",341226,"界首市",341282,"其它区",820489 );
 break;
case "341300" :
var areaOptions = new Array("埇桥区",341302,"砀山县",341321,"萧县",341322,"灵璧县",341323,"泗县",341324,"其它区",820490 );
 break;
case "341500" :
var areaOptions = new Array("金安区",341502,"裕安区",341503,"寿县",341521,"霍邱县",341522,"舒城县",341523,"金寨县",341524,"霍山县",341525,"其它区",820491,"叶集区",820981 );
 break;
case "341600" :
var areaOptions = new Array("谯城区",341602,"涡阳县",341621,"蒙城县",341622,"利辛县",341623,"其它区",820492 );
 break;
case "341700" :
var areaOptions = new Array("贵池区",341702,"东至县",341721,"石台县",341722,"青阳县",341723,"其它区",820493 );
 break;
case "341800" :
var areaOptions = new Array("宣州区",341802,"郎溪县",341821,"广德县",341822,"泾县",341823,"绩溪县",341824,"旌德县",341825,"宁国市",341881,"其它区",820494 );
 break;
case "350100" :
var areaOptions = new Array("鼓楼区",350102,"台江区",350103,"仓山区",350104,"马尾区",350105,"晋安区",350111,"闽侯县",350121,"连江县",350122,"罗源县",350123,"闽清县",350124,"永泰县",350125,"平潭县",350128,"福清市",350181,"长乐市",350182,"其它区",820495 );
 break;
case "350200" :
var areaOptions = new Array("思明区",350203,"海沧区",350205,"湖里区",350206,"集美区",350211,"同安区",350212,"翔安区",350213,"其它区",820496 );
 break;
case "350300" :
var areaOptions = new Array("城厢区",350302,"涵江区",350303,"荔城区",350304,"秀屿区",350305,"仙游县",350322,"其它区",820497 );
 break;
case "350400" :
var areaOptions = new Array("梅列区",350402,"三元区",350403,"明溪县",350421,"清流县",350423,"宁化县",350424,"大田县",350425,"尤溪县",350426,"沙县",350427,"将乐县",350428,"泰宁县",350429,"建宁县",350430,"永安市",350481,"其它区",820498 );
 break;
case "350500" :
var areaOptions = new Array("鲤城区",350502,"丰泽区",350503,"洛江区",350504,"泉港区",350505,"惠安县",350521,"安溪县",350524,"永春县",350525,"德化县",350526,"金门县",350527,"石狮市",350581,"晋江市",350582,"南安市",350583,"其它区",820499 );
 break;
case "350600" :
var areaOptions = new Array("芗城区",350602,"龙文区",350603,"云霄县",350622,"漳浦县",350623,"诏安县",350624,"长泰县",350625,"东山县",350626,"南靖县",350627,"平和县",350628,"华安县",350629,"龙海市",350681,"其它区",820500 );
 break;
case "350700" :
var areaOptions = new Array("延平区",350702,"建阳区",350703,"顺昌县",350721,"浦城县",350722,"光泽县",350723,"松溪县",350724,"政和县",350725,"邵武市",350781,"武夷山市",350782,"建瓯市",350783,"其它区",820501 );
 break;
case "350800" :
var areaOptions = new Array("新罗区",350802,"永定区",350803,"长汀县",350821,"上杭县",350823,"武平县",350824,"连城县",350825,"漳平市",350881,"其它区",820502 );
 break;
case "350900" :
var areaOptions = new Array("蕉城区",350902,"霞浦县",350921,"古田县",350922,"屏南县",350923,"寿宁县",350924,"周宁县",350925,"柘荣县",350926,"福安市",350981,"福鼎市",350982,"其它区",820503 );
 break;
case "360100" :
var areaOptions = new Array("东湖区",360102,"西湖区",360103,"青云谱区",360104,"湾里区",360105,"青山湖区",360111,"南昌县",360121,"新建县",360122,"安义县",360123,"进贤县",360124,"其它区",820504,"红谷滩新区",820982,"经济技术开发区",820983,"昌北区",820984 );
 break;
case "360200" :
var areaOptions = new Array("昌江区",360202,"珠山区",360203,"浮梁县",360222,"乐平市",360281,"其它区",820505 );
 break;
case "360300" :
var areaOptions = new Array("安源区",360302,"湘东区",360313,"莲花县",360321,"上栗县",360322,"芦溪县",360323,"其它区",820506 );
 break;
case "360400" :
var areaOptions = new Array("庐山区",360402,"浔阳区",360403,"九江县",360421,"武宁县",360423,"修水县",360424,"永修县",360425,"德安县",360426,"星子县",360427,"都昌县",360428,"湖口县",360429,"彭泽县",360430,"瑞昌市",360481,"共青城市",360482,"其它区",820507 );
 break;
case "360500" :
var areaOptions = new Array("渝水区",360502,"分宜县",360521,"其它区",820508 );
 break;
case "360600" :
var areaOptions = new Array("月湖区",360602,"余江县",360622,"贵溪市",360681,"其它区",820509 );
 break;
case "360700" :
var areaOptions = new Array("章贡区",360702,"南康区",360703,"赣县",360721,"信丰县",360722,"大余县",360723,"上犹县",360724,"崇义县",360725,"安远县",360726,"龙南县",360727,"定南县",360728,"全南县",360729,"宁都县",360730,"于都县",360731,"兴国县",360732,"会昌县",360733,"寻乌县",360734,"石城县",360735,"瑞金市",360781,"其它区",820510,"黄金区",820985 );
 break;
case "360800" :
var areaOptions = new Array("吉州区",360802,"青原区",360803,"吉安县",360821,"吉水县",360822,"峡江县",360823,"新干县",360824,"永丰县",360825,"泰和县",360826,"遂川县",360827,"万安县",360828,"安福县",360829,"永新县",360830,"井冈山市",360881,"其它区",820511 );
 break;
case "360900" :
var areaOptions = new Array("袁州区",360902,"奉新县",360921,"万载县",360922,"上高县",360923,"宜丰县",360924,"靖安县",360925,"铜鼓县",360926,"丰城市",360981,"樟树市",360982,"高安市",360983,"其它区",820512 );
 break;
case "361000" :
var areaOptions = new Array("临川区",361002,"南城县",361021,"黎川县",361022,"南丰县",361023,"崇仁县",361024,"乐安县",361025,"宜黄县",361026,"金溪县",361027,"资溪县",361028,"东乡县",361029,"广昌县",361030,"其它区",820513 );
 break;
case "361100" :
var areaOptions = new Array("信州区",361102,"广丰区",361103,"上饶县",361121,"玉山县",361123,"铅山县",361124,"横峰县",361125,"弋阳县",361126,"余干县",361127,"鄱阳县",361128,"万年县",361129,"婺源县",361130,"德兴市",361181,"其它区",820514 );
 break;
case "370100" :
var areaOptions = new Array("历下区",370102,"市中区",370103,"槐荫区",370104,"天桥区",370105,"历城区",370112,"长清区",370113,"平阴县",370124,"济阳县",370125,"商河县",370126,"章丘市",370181,"其它区",820515 );
 break;
case "370200" :
var areaOptions = new Array("市南区",370202,"市北区",370203,"黄岛区",370211,"崂山区",370212,"李沧区",370213,"城阳区",370214,"胶州市",370281,"即墨市",370282,"平度市",370283,"莱西市",370285,"其它区",820516,"四方区",820986,"开发区",820987,"胶南市",820988 );
 break;
case "370300" :
var areaOptions = new Array("淄川区",370302,"张店区",370303,"博山区",370304,"临淄区",370305,"周村区",370306,"桓台县",370321,"高青县",370322,"沂源县",370323,"其它区",820517 );
 break;
case "370400" :
var areaOptions = new Array("市中区",370402,"薛城区",370403,"峄城区",370404,"台儿庄区",370405,"山亭区",370406,"滕州市",370481,"其它区",820518 );
 break;
case "370500" :
var areaOptions = new Array("东营区",370502,"河口区",370503,"垦利县",370521,"利津县",370522,"广饶县",370523,"其它区",820519,"西城区",820989,"东城区",820990 );
 break;
case "370600" :
var areaOptions = new Array("芝罘区",370602,"福山区",370611,"牟平区",370612,"莱山区",370613,"长岛县",370634,"龙口市",370681,"莱阳市",370682,"莱州市",370683,"蓬莱市",370684,"招远市",370685,"栖霞市",370686,"海阳市",370687,"其它区",820520 );
 break;
case "370700" :
var areaOptions = new Array("潍城区",370702,"寒亭区",370703,"坊子区",370704,"奎文区",370705,"临朐县",370724,"昌乐县",370725,"青州市",370781,"诸城市",370782,"寿光市",370783,"安丘市",370784,"高密市",370785,"昌邑市",370786,"其它区",820521,"开发区",820991 );
 break;
case "370800" :
var areaOptions = new Array("任城区",370811,"兖州区",370812,"微山县",370826,"鱼台县",370827,"金乡县",370828,"嘉祥县",370829,"汶上县",370830,"泗水县",370831,"梁山县",370832,"曲阜市",370881,"邹城市",370883,"其它区",820522,"市中区",820992 );
 break;
case "370900" :
var areaOptions = new Array("泰山区",370902,"岱岳区",370911,"宁阳县",370921,"东平县",370923,"新泰市",370982,"肥城市",370983,"其它区",820523 );
 break;
case "371000" :
var areaOptions = new Array("环翠区",371002,"文登市",371081,"荣成市",371082,"乳山市",371083,"其它区",820524 );
 break;
case "371100" :
var areaOptions = new Array("东港区",371102,"岚山区",371103,"五莲县",371121,"莒县",371122,"其它区",820525 );
 break;
case "371200" :
var areaOptions = new Array("莱城区",371202,"钢城区",371203,"其它区",820526 );
 break;
case "371300" :
var areaOptions = new Array("兰山区",371302,"罗庄区",371311,"河东区",371312,"沂南县",371321,"郯城县",371322,"沂水县",371323,"兰陵县",371324,"费县",371325,"平邑县",371326,"莒南县",371327,"蒙阴县",371328,"临沭县",371329,"其它区",820527 );
 break;
case "371400" :
var areaOptions = new Array("德城区",371402,"陵城区",371403,"宁津县",371422,"庆云县",371423,"临邑县",371424,"齐河县",371425,"平原县",371426,"夏津县",371427,"武城县",371428,"乐陵市",371481,"禹城市",371482,"其它区",820528,"开发区",820993 );
 break;
case "371500" :
var areaOptions = new Array("东昌府区",371502,"阳谷县",371521,"莘县",371522,"茌平县",371523,"东阿县",371524,"冠县",371525,"高唐县",371526,"临清市",371581,"其它区",820529 );
 break;
case "371600" :
var areaOptions = new Array("滨城区",371602,"沾化区",371603,"惠民县",371621,"阳信县",371622,"无棣县",371623,"博兴县",371625,"邹平县",371626,"其它区",820530 );
 break;
case "371700" :
var areaOptions = new Array("牡丹区",371702,"曹县",371721,"单县",371722,"成武县",371723,"巨野县",371724,"郓城县",371725,"鄄城县",371726,"定陶县",371727,"东明县",371728,"其它区",820531 );
 break;
case "410100" :
var areaOptions = new Array("中原区",410102,"二七区",410103,"管城回族区",410104,"金水区",410105,"上街区",410106,"惠济区",410108,"中牟县",410122,"巩义市",410181,"荥阳市",410182,"新密市",410183,"新郑市",410184,"登封市",410185,"其它区",820532,"郑东新区",820994,"高新区",820995 );
 break;
case "410200" :
var areaOptions = new Array("龙亭区",410202,"顺河回族区",410203,"鼓楼区",410204,"禹王台区",410205,"祥符区",410212,"杞县",410221,"通许县",410222,"尉氏县",410223,"兰考县",410225,"其它区",820533,"金明区",820996 );
 break;
case "410300" :
var areaOptions = new Array("老城区",410302,"西工区",410303,"瀍河回族区",410304,"涧西区",410305,"吉利区",410306,"洛龙区",410311,"孟津县",410322,"新安县",410323,"栾川县",410324,"嵩县",410325,"汝阳县",410326,"宜阳县",410327,"洛宁县",410328,"伊川县",410329,"偃师市",410381,"其它区",820534,"高新区",820997 );
 break;
case "410400" :
var areaOptions = new Array("新华区",410402,"卫东区",410403,"石龙区",410404,"湛河区",410411,"宝丰县",410421,"叶县",410422,"鲁山县",410423,"郏县",410425,"舞钢市",410481,"汝州市",410482,"其它区",820535 );
 break;
case "410500" :
var areaOptions = new Array("文峰区",410502,"北关区",410503,"殷都区",410505,"龙安区",410506,"安阳县",410522,"汤阴县",410523,"滑县",410526,"内黄县",410527,"林州市",410581,"其它区",820536 );
 break;
case "410600" :
var areaOptions = new Array("鹤山区",410602,"山城区",410603,"淇滨区",410611,"浚县",410621,"淇县",410622,"其它区",820537 );
 break;
case "410700" :
var areaOptions = new Array("红旗区",410702,"卫滨区",410703,"凤泉区",410704,"牧野区",410711,"新乡县",410721,"获嘉县",410724,"原阳县",410725,"延津县",410726,"封丘县",410727,"长垣县",410728,"卫辉市",410781,"辉县市",410782,"其它区",820538 );
 break;
case "410800" :
var areaOptions = new Array("解放区",410802,"中站区",410803,"马村区",410804,"山阳区",410811,"修武县",410821,"博爱县",410822,"武陟县",410823,"温县",410825,"沁阳市",410882,"孟州市",410883,"其它区",820539 );
 break;
case "410900" :
var areaOptions = new Array("华龙区",410902,"清丰县",410922,"南乐县",410923,"范县",410926,"台前县",410927,"濮阳县",410928,"其它区",820540 );
 break;
case "411000" :
var areaOptions = new Array("魏都区",411002,"许昌县",411023,"鄢陵县",411024,"襄城县",411025,"禹州市",411081,"长葛市",411082,"其它区",820541 );
 break;
case "411100" :
var areaOptions = new Array("源汇区",411102,"郾城区",411103,"召陵区",411104,"舞阳县",411121,"临颍县",411122,"其它区",820542 );
 break;
case "411200" :
var areaOptions = new Array("湖滨区",411202,"陕州区",411203,"渑池县",411221,"卢氏县",411224,"义马市",411281,"灵宝市",411282,"其它区",820543 );
 break;
case "411300" :
var areaOptions = new Array("宛城区",411302,"卧龙区",411303,"南召县",411321,"方城县",411322,"西峡县",411323,"镇平县",411324,"内乡县",411325,"淅川县",411326,"社旗县",411327,"唐河县",411328,"新野县",411329,"桐柏县",411330,"邓州市",411381,"其它区",820544 );
 break;
case "411400" :
var areaOptions = new Array("梁园区",411402,"睢阳区",411403,"民权县",411421,"睢县",411422,"宁陵县",411423,"柘城县",411424,"虞城县",411425,"夏邑县",411426,"永城市",411481,"其它区",820545 );
 break;
case "411500" :
var areaOptions = new Array("浉河区",411502,"平桥区",411503,"罗山县",411521,"光山县",411522,"新县",411523,"商城县",411524,"固始县",411525,"潢川县",411526,"淮滨县",411527,"息县",411528,"其它区",820546 );
 break;
case "411600" :
var areaOptions = new Array("川汇区",411602,"扶沟县",411621,"西华县",411622,"商水县",411623,"沈丘县",411624,"郸城县",411625,"淮阳县",411626,"太康县",411627,"鹿邑县",411628,"项城市",411681,"其它区",820547 );
 break;
case "411700" :
var areaOptions = new Array("驿城区",411702,"西平县",411721,"上蔡县",411722,"平舆县",411723,"正阳县",411724,"确山县",411725,"泌阳县",411726,"汝南县",411727,"遂平县",411728,"新蔡县",411729,"其它区",820548 );
 break;
case "419000" :
var areaOptions = new Array("沁园街道",419001,"天坛街道",820549,"济水街道",820550,"北海街道",820551,"玉泉街道",820552,"克井镇",820553,"五龙口镇",820554,"轵城镇",820555,"承留镇",820556,"邵原镇",820557,"坡头镇",820558,"梨林镇",820559,"大峪镇",820560,"思礼镇",820561,"玉屋镇",820562,"下冶镇",820563,"其它区",820564 );
 break;
case "420100" :
var areaOptions = new Array("江岸区",420102,"江汉区",420103,"楚口区",420104,"汉阳区",420105,"武昌区",420106,"青山区",420107,"洪山区",420111,"东西湖区",420112,"汉南区",420113,"蔡甸区",420114,"江夏区",420115,"黄陂区",420116,"新洲区",420117,"其它区",820568 );
 break;
case "420200" :
var areaOptions = new Array("黄石港区",420202,"西塞山区",420203,"下陆区",420204,"铁山区",420205,"阳新县",420222,"大冶市",420281,"其它区",820569 );
 break;
case "420300" :
var areaOptions = new Array("茅箭区",420302,"张湾区",420303,"郧阳区",420304,"郧西县",420322,"竹山县",420323,"竹溪县",420324,"房县",420325,"丹江口市",420381,"其它区",820570,"城区",820998 );
 break;
case "420500" :
var areaOptions = new Array("西陵区",420502,"伍家岗区",420503,"点军区",420504,"虢亭区",420505,"夷陵区",420506,"远安县",420525,"兴山县",420526,"秭归县",420527,"长阳土家族自治县",420528,"五峰土家族自治县",420529,"宜都市",420581,"当阳市",420582,"枝江市",420583,"其它区",820571,"葛洲坝区",820999,"开发区",821000 );
 break;
case "420600" :
var areaOptions = new Array("襄城区",420602,"樊城区",420606,"襄州区",420607,"南漳县",420624,"谷城县",420625,"保康县",420626,"老河口市",420682,"枣阳市",420683,"宜城市",420684,"其它区",820572 );
 break;
case "420700" :
var areaOptions = new Array("梁子湖区",420702,"华容区",420703,"鄂城区",420704,"其它区",820573 );
 break;
case "420800" :
var areaOptions = new Array("东宝区",420802,"掇刀区",420804,"京山县",420821,"沙洋县",420822,"钟祥市",420881,"其它区",820574 );
 break;
case "420900" :
var areaOptions = new Array("孝南区",420902,"孝昌县",420921,"大悟县",420922,"云梦县",420923,"应城市",420981,"安陆市",420982,"汉川市",420984,"其它区",820575 );
 break;
case "421000" :
var areaOptions = new Array("沙市区",421002,"荆州区",421003,"公安县",421022,"监利县",421023,"江陵县",421024,"石首市",421081,"洪湖市",421083,"松滋市",421087,"其它区",820680 );
 break;
case "421100" :
var areaOptions = new Array("黄州区",421102,"团风县",421121,"红安县",421122,"罗田县",421123,"英山县",421124,"浠水县",421125,"蕲春县",421126,"黄梅县",421127,"麻城市",421181,"武穴市",421182,"其它区",820576 );
 break;
case "421200" :
var areaOptions = new Array("咸安区",421202,"嘉鱼县",421221,"通城县",421222,"崇阳县",421223,"通山县",421224,"赤壁市",421281,"其它区",820577,"温泉城区",821001 );
 break;
case "421300" :
var areaOptions = new Array("曾都区",421303,"随县",421321,"广水市",421381,"其它区",820578 );
 break;
case "422800" :
var areaOptions = new Array("恩施市",422801,"利川市",422802,"建始县",422822,"巴东县",422823,"宣恩县",422825,"咸丰县",422826,"来凤县",422827,"鹤峰县",422828,"其它区",820579 );
 break;
case "429000" :
var areaOptions = new Array("沙嘴街道",429004,"千河街道",429005,"龙华山办事处",429006,"郑场镇",429021,"毛嘴镇",820580,"豆河镇",820581,"三伏潭镇",820582,"胡场镇",820583,"长倘口镇",820584,"西流河镇",820585,"沙湖镇",820586,"杨林尾镇",820587,"彭场镇",820588,"张沟镇",820589,"郭河镇",820590,"沔城回族镇",820591,"通海口镇",820592,"陈场镇",820593,"工业园区",820594,"九合垸原种场",820595,"沙湖原种场",820596,"五湖渔场",820597,"赵西垸林场",820598,"畜禽良种场",820599,"排湖风景区",820600,"其它区",820601 );
 break;
case "820565" :
var areaOptions = new Array("园林办事处",820602,"杨市办事处",820603,"周矶办事处",820604,"广华办事处",820605,"泰丰办事处",820606,"高场办事处",820607,"竹根滩镇",820608,"渔洋镇",820609,"王场镇",820610,"高石碑镇",820611,"熊口镇",820612,"老新镇",820613,"浩口镇",820614,"积玉口镇",820615,"张金镇",820616,"龙湾镇",820617,"江汉石油管理局",820618,"潜江经济开发区",820619,"周矶管理区",820620,"后湖管理区",820621,"熊口管理区",820622,"总口管理区",820623,"白鹭湖管理区",820624,"运粮湖管理区",820625,"浩口原种场",820626,"其它区",820627 );
 break;
case "820566" :
var areaOptions = new Array("竟陵街道",820628,"侨乡街道开发区",820629,"杨林街道",820630,"多宝镇",820631,"拖市镇",820632,"张港镇",820633,"蒋场镇",820634,"汪场镇",820635,"渔薪镇",820636,"黄潭镇",820637,"岳口镇",820638,"横林镇",820639,"彭市镇",820640,"麻洋镇",820641,"多祥镇",820642,"干驿镇",820643,"马湾镇",820644,"卢市镇",820645,"小板镇",820646,"九真镇",820647,"皂市镇",820648,"胡市镇",820649,"石河镇",820650,"佛子山镇",820651,"净潭乡",820652,"蒋湖农场",820653,"白茅湖农场",820654,"沉湖管委会",820655,"其它区",820656 );
 break;
case "820567" :
var areaOptions = new Array("松柏镇",820657,"阳日镇",820658,"木鱼镇",820659,"红坪镇",820660,"新华镇",820661,"九湖镇",820662,"宋洛乡",820663,"下谷坪土家族乡",820664,"其它区",820665 );
 break;
case "430100" :
var areaOptions = new Array("芙蓉区",430102,"天心区",430103,"岳麓区",430104,"开福区",430105,"雨花区",430111,"望城区",430112,"长沙县",430121,"宁乡县",430124,"浏阳市",430181,"其它区",820666 );
 break;
case "430200" :
var areaOptions = new Array("荷塘区",430202,"芦淞区",430203,"石峰区",430204,"天元区",430211,"株洲县",430221,"攸县",430223,"茶陵县",430224,"炎陵县",430225,"醴陵市",430281,"其它区",820667 );
 break;
case "430300" :
var areaOptions = new Array("雨湖区",430302,"岳塘区",430304,"湘潭县",430321,"湘乡市",430381,"韶山市",430382,"其它区",820668 );
 break;
case "430400" :
var areaOptions = new Array("珠晖区",430405,"雁峰区",430406,"石鼓区",430407,"蒸湘区",430408,"南岳区",430412,"衡阳县",430421,"衡南县",430422,"衡山县",430423,"衡东县",430424,"祁东县",430426,"耒阳市",430481,"常宁市",430482,"其它区",820669 );
 break;
case "430500" :
var areaOptions = new Array("双清区",430502,"大祥区",430503,"北塔区",430511,"邵东县",430521,"新邵县",430522,"邵阳县",430523,"隆回县",430524,"洞口县",430525,"绥宁县",430527,"新宁县",430528,"城步苗族自治县",430529,"武冈市",430581,"其它区",820670 );
 break;
case "430600" :
var areaOptions = new Array("岳阳楼区",430602,"云溪区",430603,"君山区",430611,"岳阳县",430621,"华容县",430623,"湘阴县",430624,"平江县",430626,"汨罗市",430681,"临湘市",430682,"其它区",820671 );
 break;
case "430700" :
var areaOptions = new Array("武陵区",430702,"鼎城区",430703,"安乡县",430721,"汉寿县",430722,"澧县",430723,"临澧县",430724,"桃源县",430725,"石门县",430726,"津市市",430781,"其它区",820672 );
 break;
case "430800" :
var areaOptions = new Array("永定区",430802,"武陵源区",430811,"慈利县",430821,"桑植县",430822,"其它区",820673 );
 break;
case "430900" :
var areaOptions = new Array("资阳区",430902,"赫山区",430903,"南县",430921,"桃江县",430922,"安化县",430923,"沅江市",430981,"其它区",820674 );
 break;
case "431000" :
var areaOptions = new Array("北湖区",431002,"苏仙区",431003,"桂阳县",431021,"宜章县",431022,"永兴县",431023,"嘉禾县",431024,"临武县",431025,"汝城县",431026,"桂东县",431027,"安仁县",431028,"资兴市",431081,"其它区",820675 );
 break;
case "431100" :
var areaOptions = new Array("零陵区",431102,"冷水滩区",431103,"祁阳县",431121,"东安县",431122,"双牌县",431123,"道县",431124,"江永县",431125,"宁远县",431126,"蓝山县",431127,"新田县",431128,"江华瑶族自治县",431129,"其它区",820676 );
 break;
case "431200" :
var areaOptions = new Array("鹤城区",431202,"中方县",431221,"沅陵县",431222,"辰溪县",431223,"溆浦县",431224,"会同县",431225,"麻阳苗族自治县",431226,"新晃侗族自治县",431227,"芷江侗族自治县",431228,"靖州苗族侗族自治县",431229,"通道侗族自治县",431230,"洪江市",431281,"其它区",820677 );
 break;
case "431300" :
var areaOptions = new Array("娄星区",431302,"双峰县",431321,"新化县",431322,"冷水江市",431381,"涟源市",431382,"其它区",820678 );
 break;
case "433100" :
var areaOptions = new Array("吉首市",433101,"泸溪县",433122,"凤凰县",433123,"花垣县",433124,"保靖县",433125,"古丈县",433126,"永顺县",433127,"龙山县",433130,"其它区",820679 );
 break;
case "440100" :
var areaOptions = new Array("荔湾区",440103,"越秀区",440104,"海珠区",440105,"天河区",440106,"白云区",440111,"黄埔区",440112,"番禺区",440113,"花都区",440114,"南沙区",440115,"从化区",440117,"增城区",440118,"其它区",820682,"萝岗区",820688,"东山区",820689 );
 break;
case "440200" :
var areaOptions = new Array("武江区",440203,"浈江区",440204,"曲江区",440205,"始兴县",440222,"仁化县",440224,"翁源县",440229,"乳源瑶族自治县",440232,"新丰县",440233,"乐昌市",440281,"南雄市",440282,"其它区",820683 );
 break;
case "440300" :
var areaOptions = new Array("罗湖区",440303,"福田区",440304,"南山区",440305,"宝安区",440306,"龙岗区",440307,"盐田区",440308,"其它区",820684,"光明新区",820690,"坪山新区",820691,"大鹏新区",820692,"龙华新区",820693 );
 break;
case "440400" :
var areaOptions = new Array("香洲区",440402,"斗门区",440403,"金湾区",440404,"其它区",820685,"金唐区",820686,"南湾区",820687 );
 break;
case "440500" :
var areaOptions = new Array("龙湖区",440507,"金平区",440511,"濠江区",440512,"潮阳区",440513,"潮南区",440514,"澄海区",440515,"南澳县",440523,"其它区",820694 );
 break;
case "440600" :
var areaOptions = new Array("禅城区",440604,"南海区",440605,"顺德区",440606,"三水区",440607,"高明区",440608,"其它区",820695 );
 break;
case "440700" :
var areaOptions = new Array("蓬江区",440703,"江海区",440704,"新会区",440705,"台山市",440781,"开平市",440783,"鹤山市",440784,"恩平市",440785,"其它区",820696 );
 break;
case "440800" :
var areaOptions = new Array("赤坎区",440802,"霞山区",440803,"坡头区",440804,"麻章区",440811,"遂溪县",440823,"徐闻县",440825,"廉江市",440881,"雷州市",440882,"吴川市",440883,"其它区",820697 );
 break;
case "440900" :
var areaOptions = new Array("茂南区",440902,"电白区",440904,"高州市",440981,"化州市",440982,"信宜市",440983,"其它区",820698,"电白县",821002 );
 break;
case "441200" :
var areaOptions = new Array("端州区",441202,"鼎湖区",441203,"广宁县",441223,"怀集县",441224,"封开县",441225,"德庆县",441226,"高要市",441283,"四会市",441284,"其它区",820699 );
 break;
case "441300" :
var areaOptions = new Array("惠城区",441302,"惠阳区",441303,"博罗县",441322,"惠东县",441323,"龙门县",441324,"其它区",820700 );
 break;
case "441400" :
var areaOptions = new Array("梅江区",441402,"梅县区",441403,"大埔县",441422,"丰顺县",441423,"五华县",441424,"平远县",441426,"蕉岭县",441427,"兴宁市",441481,"其它区",820701 );
 break;
case "441500" :
var areaOptions = new Array("城区",441502,"海丰县",441521,"陆河县",441523,"陆丰市",441581,"其它区",820702 );
 break;
case "441600" :
var areaOptions = new Array("源城区",441602,"紫金县",441621,"龙川县",441622,"连平县",441623,"和平县",441624,"东源县",441625,"其它区",820703 );
 break;
case "441700" :
var areaOptions = new Array("江城区",441702,"阳东区",441704,"阳西县",441721,"阳春市",441781,"其它区",820704 );
 break;
case "441800" :
var areaOptions = new Array("清城区",441802,"清新区",441803,"佛冈县",441821,"阳山县",441823,"连山壮族瑶族自治县",441825,"连南瑶族自治县",441826,"英德市",441881,"连州市",441882,"其它区",820705 );
 break;
case "441900" :
var areaOptions = new Array("大朗镇",820305,"莞城街道",820309,"东城街道",820310,"南城街道",820311,"万江街道",820312,"黄江镇",820313,"大岭山镇",820314,"寮步镇",820315,"凤岗镇",820316,"清溪镇",820317,"塘厦镇",820318,"谢岗镇",820319,"樟木头镇",820320,"厚街镇",820321,"沙田镇",820322,"长安镇",820323,"虎门镇",820324,"常平镇",820325,"横沥镇",820326,"东坑镇",820327,"桥头镇",820328,"企石镇",820329,"茶山镇",820330,"石排镇",820331,"石龙镇",820332,"石碣镇",820333,"高埗镇",820334,"道滘镇",820335,"洪梅镇",820336,"望牛墩镇",820337,"中堂镇",820338,"麻涌镇",820339,"松山湖管委会",820340,"虎门港管委会",820706,"东莞生态园",820707,"其它区",820708 );
 break;
case "442000" :
var areaOptions = new Array("石岐区街道",820709,"东区街道",820710,"火炬开发区街道",820711,"西区街道",820712,"南区街道",820713,"五桂山街道",820714,"小榄镇",820715,"黄圃镇",820716,"民众镇",820717,"东凤镇",820718,"东升镇",820719,"古镇镇",820720,"沙溪镇",820721,"坦洲镇",820722,"港口镇",820723,"三角镇",820724,"横栏镇",820725,"南头镇",820726,"阜沙镇",820727,"南朗镇",820728,"三乡镇",820729,"板芙镇",820730,"大涌镇",820731,"神湾镇",820732,"其它区",820733 );
 break;
case "445100" :
var areaOptions = new Array("湘桥区",445102,"潮安区",445103,"饶平县",445122,"枫溪区",820734,"其它区",820735 );
 break;
case "445200" :
var areaOptions = new Array("榕城区",445202,"揭东区",445203,"揭西县",445222,"惠来县",445224,"普宁市",445281,"东山区",820736,"其它区",820737 );
 break;
case "445300" :
var areaOptions = new Array("云城区",445302,"云安区",445303,"新兴县",445321,"郁南县",445322,"罗定市",445381,"其它区",820738 );
 break;
case "820681" :
var areaOptions = new Array("东沙群岛",820739,"其它区",820740 );
 break;
case "450100" :
var areaOptions = new Array("兴宁区",450102,"青秀区",450103,"江南区",450105,"西乡塘区",450107,"良庆区",450108,"邕宁区",450109,"武鸣区",450110,"隆安县",450123,"马山县",450124,"上林县",450125,"宾阳县",450126,"横县",450127,"其它区",820741 );
 break;
case "450200" :
var areaOptions = new Array("城中区",450202,"鱼峰区",450203,"柳南区",450204,"柳北区",450205,"柳江县",450221,"柳城县",450222,"鹿寨县",450223,"融安县",450224,"融水苗族自治县",450225,"三江侗族自治县",450226,"其它区",820742 );
 break;
case "450300" :
var areaOptions = new Array("秀峰区",450302,"叠彩区",450303,"象山区",450304,"七星区",450305,"雁山区",450311,"临桂区",450312,"阳朔县",450321,"灵川县",450323,"全州县",450324,"兴安县",450325,"永福县",450326,"灌阳县",450327,"龙胜各族自治县",450328,"资源县",450329,"平乐县",450330,"荔浦县",450331,"恭城瑶族自治县",450332,"其它区",820743 );
 break;
case "450400" :
var areaOptions = new Array("万秀区",450403,"长洲区",450405,"龙圩区",450406,"苍梧县",450421,"藤县",450422,"蒙山县",450423,"岑溪市",450481,"其它区",820744,"蝶山区",821003 );
 break;
case "450500" :
var areaOptions = new Array("海城区",450502,"银海区",450503,"铁山港区",450512,"合浦县",450521,"其它区",820745 );
 break;
case "450600" :
var areaOptions = new Array("港口区",450602,"防城区",450603,"上思县",450621,"东兴市",450681,"其它区",820746 );
 break;
case "450700" :
var areaOptions = new Array("钦南区",450702,"钦北区",450703,"灵山县",450721,"浦北县",450722,"其它区",820747 );
 break;
case "450800" :
var areaOptions = new Array("港北区",450802,"港南区",450803,"覃塘区",450804,"平南县",450821,"桂平市",450881,"其它区",820748 );
 break;
case "450900" :
var areaOptions = new Array("玉州区",450902,"福绵区",450903,"容县",450921,"陆川县",450922,"博白县",450923,"兴业县",450924,"北流市",450981,"其它区",820749 );
 break;
case "451000" :
var areaOptions = new Array("右江区",451002,"田阳县",451021,"田东县",451022,"平果县",451023,"德保县",451024,"靖西县",451025,"那坡县",451026,"凌云县",451027,"乐业县",451028,"田林县",451029,"西林县",451030,"隆林各族自治县",451031,"其它区",820750 );
 break;
case "451100" :
var areaOptions = new Array("八步区",451102,"平桂管理区",451119,"昭平县",451121,"钟山县",451122,"富川瑶族自治县",451123,"其它区",820751 );
 break;
case "451200" :
var areaOptions = new Array("金城江区",451202,"南丹县",451221,"天峨县",451222,"凤山县",451223,"东兰县",451224,"罗城仫佬族自治县",451225,"环江毛南族自治县",451226,"巴马瑶族自治县",451227,"都安瑶族自治县",451228,"大化瑶族自治县",451229,"宜州市",451281,"其它区",820752 );
 break;
case "451300" :
var areaOptions = new Array("兴宾区",451302,"忻城县",451321,"象州县",451322,"武宣县",451323,"金秀瑶族自治县",451324,"合山市",451381,"其它区",820753 );
 break;
case "451400" :
var areaOptions = new Array("江州区",451402,"扶绥县",451421,"宁明县",451422,"龙州县",451423,"大新县",451424,"天等县",451425,"凭祥市",451481,"其它区",820754 );
 break;
case "460100" :
var areaOptions = new Array("秀英区",460105,"龙华区",460106,"琼山区",460107,"美兰区",460108,"其它区",820772 );
 break;
case "460200" :
var areaOptions = new Array("海棠区",460202,"吉阳区",460203,"凤凰镇",460204,"崖州区",460205,"天涯区",820773,"育才镇",820774,"国营南田农场",820775,"国营南新农场",820776,"国营立才农场",820777,"国营南滨农场",820778,"河西区街道",820779,"河东区街道",820780,"其它区",820781 );
 break;
case "460300" :
var areaOptions = new Array("西沙群岛",820782,"南沙群岛",820783,"中沙群岛岛礁及其海域",820784,"其它区",820785 );
 break;
case "460400" :
var areaOptions = new Array("那大镇",820786,"和庆镇",820787,"南丰镇",820788,"大成镇",820789,"雅星镇",820790,"兰洋镇",820791,"光村镇",820792,"木棠镇",820793,"海头镇",820794,"峨蔓镇",820795,"三都镇",820796,"王五镇",820797,"白马井镇",820798,"中和镇",820799,"排浦镇",820800,"东成镇",820801,"新州镇",820802,"国营西培农场",820803,"国营西联农场",820804,"国营蓝洋农场",820805,"国营八一农场",820806,"洋浦经济开发区",820807,"华南热作学院",820808,"其它区",820809 );
 break;
case "469000" :
var areaOptions = new Array("通什镇",469001,"南圣镇",469002,"毛阳镇",469005,"番阳镇",469006,"畅好乡",469007,"毛道乡",469021,"水满乡",469022,"国营畅好农场",469023,"其它区",469024 );
 break;
case "820755" :
var areaOptions = new Array("嘉积镇",820810,"万泉镇",820811,"石壁镇",820812,"中原镇",820813,"博鳌镇",820814,"阳江镇",820815,"龙江镇",820816,"潭门镇",820817,"塔洋镇",820818,"长坡镇",820819,"大路镇",820820,"会山镇",820821,"国营东太农场",820822,"国营东红农场",820823,"国营东升农场",820824,"彬村山华侨农场",820825,"其它区",820826 );
 break;
case "820756" :
var areaOptions = new Array("文城镇",820827,"重兴镇",820828,"蓬莱镇",820829,"会文镇",820830,"东路镇",820831,"潭牛镇",820832,"东阁镇",820833,"文教镇",820834,"东郊镇",820835,"龙楼镇",820836,"昌洒镇",820837,"翁田镇",820838,"抱罗镇",820839,"冯坡镇",820840,"锦山镇",820841,"铺前镇",820842,"公坡镇",820843,"国营东路农场",820844,"国营南阳农场",820845,"国营罗豆农场",820846,"其它区",820847 );
 break;
case "820757" :
var areaOptions = new Array("万城镇",820848,"龙滚镇",820849,"和乐镇",820850,"后安镇",820851,"大茂镇",820852,"东澳镇",820853,"礼纪镇",820854,"长丰镇",820855,"山根镇",820856,"北大镇",820857,"南桥镇",820858,"三更罗镇",820859,"国营东兴农场",820860,"国营东和农场",820861,"国营新中农场",820862,"兴隆华侨农场",820863,"地方国营六连林场",820864,"其它区",820865 );
 break;
case "820758" :
var areaOptions = new Array("八所镇",820866,"东河镇",820867,"大田镇",820868,"感城镇",820869,"板桥镇",820870,"三家镇",820871,"四更镇",820872,"新龙镇",820873,"天安乡",820874,"江边乡",820875,"国营广坝农场",820876,"东方华侨农场",820877,"其它区",820878 );
 break;
case "820759" :
var areaOptions = new Array("定城镇",820879,"新竹镇",820880,"龙湖镇",820881,"黄竹镇",820882,"雷鸣镇",820883,"龙门镇",820884,"龙河镇",820885,"岭口镇",820886,"翰林镇",820887,"富文镇",820888,"国营中瑞农场",820889,"国营南海农场",820890,"国营金鸡岭农场",820891,"其它区",820892 );
 break;
case "820760" :
var areaOptions = new Array("屯城镇",820893,"新兴镇",820894,"枫木镇",820895,"乌坡镇",820896,"南吕镇",820897,"南坤镇",820898,"坡心镇",820899,"西昌镇",820900,"国营中建农场",820901,"国营中坤农场",820902,"其它区",820903 );
 break;
case "820761" :
var areaOptions = new Array("金江镇",820904,"老城镇",820905,"瑞溪镇",820906,"永发镇",820907,"加乐镇",820908,"文儒镇",820909,"中兴镇",820910,"仁兴镇",820911,"福山镇",820912,"桥头镇",820913,"大丰镇",820914,"国营红光农场",820915,"国营红岗农场",820916,"国营西达农场",820917,"国营昆仑农场",820918,"国营和岭农场",820919,"国营金安农场",820920,"其它区",820921 );
 break;
case "820762" :
var areaOptions = new Array("临城镇",820922,"波莲镇",820923,"东英镇",820924,"博厚镇",820925,"皇桐镇",820926,"多文镇",820927,"和舍镇",820928,"南宝镇",820929,"新盈镇",820930,"调楼镇",820931,"国营红华农场",820932,"国营加来农场",820933,"其它区",820934 );
 break;
case "820763" :
var areaOptions = new Array("牙叉镇",821004,"七坊镇",821005,"邦溪镇",821006,"打安镇",821007,"细水乡",821008,"元门乡",821009,"南开乡",821010,"阜龙乡",821011,"青松乡",821012,"金波乡",821013,"荣邦乡",821014,"国营白沙农场",821015,"国营龙江农场",821016,"国营邦溪农场",821017,"其它区",821018 );
 break;
case "820764" :
var areaOptions = new Array("石碌镇",821019,"叉河镇",821020,"十月田镇",821021,"乌烈镇",821022,"昌化镇",821023,"海尾镇",821024,"七叉镇",821025,"王下乡",821026,"国营红林农场",821027,"国营霸王岭林场",821028,"海南矿业联合有限公司",821029,"其它区",821030 );
 break;
case "820765" :
var areaOptions = new Array("抱由镇",821031,"万冲镇",821032,"大安镇",821033,"志仲镇",821034,"千家镇",821035,"九所镇",821036,"利国镇",821037,"黄流镇",821038,"佛罗镇",821039,"尖峰镇",821040,"莺歌海镇",821041,"国营山荣农场",821042,"国营乐光农场",821043,"国营保国农场",821044,"国营尖峰岭林业公司",821045,"国营莺歌海盐场",821046,"其它区",821047 );
 break;
case "820766" :
var areaOptions = new Array("椰林镇",821048,"光坡镇",821049,"三才镇",821050,"英州镇",821051,"隆广镇",821052,"文罗镇",821053,"本号镇",821054,"新村镇",821055,"黎安镇",821056,"提蒙乡",821057,"群英乡",821058,"国营岭门农场",821059,"国营南平农场",821060,"国营吊罗山林业公司",821061,"其它区",821062 );
 break;
case "820767" :
var areaOptions = new Array("保城镇",821063,"什玲镇",821064,"加茂镇",821065,"响水镇",821066,"新政镇",821067,"三道镇",821068,"六弓乡",821069,"南林乡",821070,"毛感乡",821071,"国营新星农场",821072,"海南保亭热带作物研究",821073,"国营金江农场",821074,"国营三道农场",821075,"其它区",821076 );
 break;
case "820768" :
var areaOptions = new Array("营根镇",821077,"湾岭镇",821078,"黎母山镇",821079,"和平镇",821080,"长征镇",821081,"红毛镇",821082,"中平镇",821083,"吊罗山乡",821084,"上安乡",821085,"什运乡",821086,"国营阳江农场",821087,"国营乌石农场",821088,"国营加钗农场",821089,"国营长征农场",821090,"国营黎母山林业公司",821091,"其它区",821092 );
 break;
case "500100" :
var areaOptions = new Array("万州区",500101,"涪陵区",500102,"渝中区",500103,"大渡口区",500104,"江北区",500105,"沙坪坝区",500106,"九龙坡区",500107,"南岸区",500108,"北碚区",500109,"綦江区",500110,"大足区",500111,"渝北区",500112,"巴南区",500113,"黔江区",500114,"长寿区",500115,"江津区",500116,"合川区",500117,"永川区",500118,"南川区",500119,"璧山区",500120,"铜梁区",500151,"万盛区",821093,"双桥区",821094,"潼南县",821095,"荣昌县",821096,"梁平县",821097,"城口县",821098,"丰都县",821099,"垫江县",821100,"武隆县",821101,"忠县",821102,"开县",821103,"云阳县",821104,"奉节县",821105,"巫山县",821106,"巫溪县",821107,"石柱土家族自治县",821108,"秀山土家族苗族自治县",821109,"酉阳土家族苗族自治县",821110,"彭水苗族土家族自治县",821111,"其它区",821112 );
 break;
case "510100" :
var areaOptions = new Array("锦江区",510104,"青羊区",510105,"金牛区",510106,"武侯区",510107,"成华区",510108,"龙泉驿区",510112,"青白江区",510113,"新都区",510114,"温江区",510115,"金堂县",510121,"双流县",510122,"郫县",510124,"大邑县",510129,"蒲江县",510131,"新津县",510132,"都江堰市",510181,"彭州市",510182,"邛崃市",510183,"崇州市",510184,"其它区",821113 );
 break;
case "510300" :
var areaOptions = new Array("自流井区",510302,"贡井区",510303,"大安区",510304,"沿滩区",510311,"荣县",510321,"富顺县",510322,"其它区",821114 );
 break;
case "510400" :
var areaOptions = new Array("东区",510402,"西区",510403,"仁和区",510411,"米易县",510421,"盐边县",510422,"其它区",821115 );
 break;
case "510500" :
var areaOptions = new Array("江阳区",510502,"纳溪区",510503,"龙马潭区",510504,"泸县",510521,"合江县",510522,"叙永县",510524,"古蔺县",510525,"其它区",821116 );
 break;
case "510600" :
var areaOptions = new Array("旌阳区",510603,"中江县",510623,"罗江县",510626,"广汉市",510681,"什邡市",510682,"绵竹市",510683,"其它区",821117 );
 break;
case "510700" :
var areaOptions = new Array("涪城区",510703,"游仙区",510704,"三台县",510722,"盐亭县",510723,"安县",510724,"梓潼县",510725,"北川羌族自治县",510726,"平武县",510727,"江油市",510781,"其它区",821118,"高新区",821119 );
 break;
case "510800" :
var areaOptions = new Array("利州区",510802,"昭化区",510811,"朝天区",510812,"旺苍县",510821,"青川县",510822,"剑阁县",510823,"苍溪县",510824,"其它区",821120 );
 break;
case "510900" :
var areaOptions = new Array("船山区",510903,"安居区",510904,"蓬溪县",510921,"射洪县",510922,"大英县",510923,"其它区",821121 );
 break;
case "511000" :
var areaOptions = new Array("市中区",511002,"东兴区",511011,"威远县",511024,"资中县",511025,"隆昌县",511028,"其它区",821122 );
 break;
case "511100" :
var areaOptions = new Array("市中区",511102,"沙湾区",511111,"五通桥区",511112,"金口河区",511113,"犍为县",511123,"井研县",511124,"夹江县",511126,"沐川县",511129,"峨边彝族自治县",511132,"马边彝族自治县",511133,"峨眉山市",511181,"其它区",821123 );
 break;
case "511300" :
var areaOptions = new Array("顺庆区",511302,"高坪区",511303,"嘉陵区",511304,"南部县",511321,"营山县",511322,"蓬安县",511323,"仪陇县",511324,"西充县",511325,"阆中市",511381,"其它区",821124 );
 break;
case "511400" :
var areaOptions = new Array("东坡区",511402,"彭山区",511403,"仁寿县",511421,"洪雅县",511423,"丹棱县",511424,"青神县",511425,"其它区",821125 );
 break;
case "511500" :
var areaOptions = new Array("翠屏区",511502,"南溪区",511503,"宜宾县",511521,"江安县",511523,"长宁县",511524,"高县",511525,"珙县",511526,"筠连县",511527,"兴文县",511528,"屏山县",511529,"其它区",821126 );
 break;
case "511600" :
var areaOptions = new Array("广安区",511602,"前锋区",511603,"岳池县",511621,"武胜县",511622,"邻水县",511623,"华蓥市",511681,"其它区",821127,"市辖区",821128 );
 break;
case "511700" :
var areaOptions = new Array("通川区",511702,"达川区",511703,"宣汉县",511722,"开江县",511723,"大竹县",511724,"渠县",511725,"万源市",511781,"其它区",821129 );
 break;
case "511800" :
var areaOptions = new Array("雨城区",511802,"名山区",511803,"荥经县",511822,"汉源县",511823,"石棉县",511824,"天全县",511825,"芦山县",511826,"宝兴县",511827,"其它区",821130 );
 break;
case "511900" :
var areaOptions = new Array("巴州区",511902,"恩阳区",511903,"通江县",511921,"南江县",511922,"平昌县",511923,"其它区",821131 );
 break;
case "512000" :
var areaOptions = new Array("雁江区",512002,"安岳县",512021,"乐至县",512022,"简阳市",512081,"其它区",821132 );
 break;
case "513200" :
var areaOptions = new Array("汶川县",513221,"理县",513222,"茂县",513223,"松潘县",513224,"九寨沟县",513225,"金川县",513226,"小金县",513227,"黑水县",513228,"马尔康县",513229,"壤塘县",513230,"阿坝县",513231,"若尔盖县",513232,"红原县",513233,"其它区",821133 );
 break;
case "513300" :
var areaOptions = new Array("康定市",513301,"泸定县",513322,"丹巴县",513323,"九龙县",513324,"雅江县",513325,"道孚县",513326,"炉霍县",513327,"甘孜县",513328,"新龙县",513329,"德格县",513330,"白玉县",513331,"石渠县",513332,"色达县",513333,"理塘县",513334,"巴塘县",513335,"乡城县",513336,"稻城县",513337,"得荣县",513338,"其它区",821134 );
 break;
case "513400" :
var areaOptions = new Array("西昌市",513401,"木里藏族自治县",513422,"盐源县",513423,"德昌县",513424,"会理县",513425,"会东县",513426,"宁南县",513427,"普格县",513428,"布拖县",513429,"金阳县",513430,"昭觉县",513431,"喜德县",513432,"冕宁县",513433,"越西县",513434,"甘洛县",513435,"美姑县",513436,"雷波县",513437,"其它区",821135 );
 break;
case "520100" :
var areaOptions = new Array("南明区",520102,"云岩区",520103,"花溪区",520111,"乌当区",520112,"白云区",520113,"观山湖区",520115,"开阳县",520121,"息烽县",520122,"修文县",520123,"清镇市",520181,"其它区",821136,"小河区",821137 );
 break;
case "520200" :
var areaOptions = new Array("钟山区",520201,"六枝特区",520203,"水城县",520221,"盘县",520222,"其它区",821138 );
 break;
case "520300" :
var areaOptions = new Array("红花岗区",520302,"汇川区",520303,"遵义县",520321,"桐梓县",520322,"绥阳县",520323,"正安县",520324,"道真仡佬族苗族自治县",520325,"务川仡佬族苗族自治县",520326,"凤冈县",520327,"湄潭县",520328,"余庆县",520329,"习水县",520330,"赤水市",520381,"仁怀市",520382,"其它区",821139 );
 break;
case "520400" :
var areaOptions = new Array("西秀区",520402,"平坝区",520403,"普定县",520422,"镇宁布依族苗族自治县",520423,"关岭布依族苗族自治县",520424,"紫云苗族布依族自治县",520425,"其它区",821140 );
 break;
case "520500" :
var areaOptions = new Array("七星关区",520502,"大方县",520521,"黔西县",520522,"金沙县",520523,"织金县",520524,"纳雍县",520525,"威宁彝族回族苗族自治",520526,"赫章县",520527,"其它区",821141 );
 break;
case "520600" :
var areaOptions = new Array("碧江区",520602,"万山区",520603,"江口县",520621,"玉屏侗族自治县",520622,"石阡县",520623,"思南县",520624,"印江土家族苗族自治县",520625,"德江县",520626,"沿河土家族自治县",520627,"松桃苗族自治县",520628,"其它区",821142 );
 break;
case "522300" :
var areaOptions = new Array("兴义市",522301,"兴仁县",522322,"普安县",522323,"晴隆县",522324,"贞丰县",522325,"望谟县",522326,"册亨县",522327,"安龙县",522328,"其它区",821143 );
 break;
case "522600" :
var areaOptions = new Array("凯里市",522601,"黄平县",522622,"施秉县",522623,"三穗县",522624,"镇远县",522625,"岑巩县",522626,"天柱县",522627,"锦屏县",522628,"剑河县",522629,"台江县",522630,"黎平县",522631,"榕江县",522632,"从江县",522633,"雷山县",522634,"麻江县",522635,"丹寨县",522636,"其它区",821144 );
 break;
case "522700" :
var areaOptions = new Array("都匀市",522701,"福泉市",522702,"荔波县",522722,"贵定县",522723,"瓮安县",522725,"独山县",522726,"平塘县",522727,"罗甸县",522728,"长顺县",522729,"龙里县",522730,"惠水县",522731,"三都水族自治县",522732,"其它区",821145 );
 break;
case "530100" :
var areaOptions = new Array("五华区",530102,"盘龙区",530103,"官渡区",530111,"西山区",530112,"东川区",530113,"呈贡区",530114,"晋宁县",530122,"富民县",530124,"宜良县",530125,"石林彝族自治县",530126,"嵩明县",530127,"禄劝彝族苗族自治县",530128,"寻甸回族彝族自治县",530129,"安宁市",530181,"其它区",821146 );
 break;
case "530300" :
var areaOptions = new Array("麒麟区",530302,"马龙县",530321,"陆良县",530322,"师宗县",530323,"罗平县",530324,"富源县",530325,"会泽县",530326,"沾益县",530328,"宣威市",530381,"其它区",821147 );
 break;
case "530400" :
var areaOptions = new Array("红塔区",530402,"江川县",530421,"澄江县",530422,"通海县",530423,"华宁县",530424,"易门县",530425,"峨山彝族自治县",530426,"新平彝族傣族自治县",530427,"元江哈尼族彝族傣族自",530428,"其它区",821148 );
 break;
case "530500" :
var areaOptions = new Array("隆阳区",530502,"施甸县",530521,"腾冲县",530522,"龙陵县",530523,"昌宁县",530524,"其它区",821149 );
 break;
case "530600" :
var areaOptions = new Array("昭阳区",530602,"鲁甸县",530621,"巧家县",530622,"盐津县",530623,"大关县",530624,"永善县",530625,"绥江县",530626,"镇雄县",530627,"彝良县",530628,"威信县",530629,"水富县",530630,"其它区",821150 );
 break;
case "530700" :
var areaOptions = new Array("古城区",530702,"玉龙纳西族自治县",530721,"永胜县",530722,"华坪县",530723,"宁蒗彝族自治县",530724,"其它区",821151 );
 break;
case "530800" :
var areaOptions = new Array("思茅区",530802,"宁洱哈尼族彝族自治县",530821,"墨江哈尼族自治县",530822,"景东彝族自治县",530823,"景谷傣族彝族自治县",530824,"镇沅彝族哈尼族拉祜族",530825,"江城哈尼族彝族自治县",530826,"孟连傣族拉祜族佤族自",530827,"澜沧拉祜族自治县",530828,"西盟佤族自治县",530829,"其它区",821152 );
 break;
case "530900" :
var areaOptions = new Array("临翔区",530902,"凤庆县",530921,"云县",530922,"永德县",530923,"镇康县",530924,"双江拉祜族佤族布朗族",530925,"耿马傣族佤族自治县",530926,"沧源佤族自治县",530927,"其它区",821153 );
 break;
case "532300" :
var areaOptions = new Array("楚雄市",532301,"双柏县",532322,"牟定县",532323,"南华县",532324,"姚安县",532325,"大姚县",532326,"永仁县",532327,"元谋县",532328,"武定县",532329,"禄丰县",532331,"其它区",821154 );
 break;
case "532500" :
var areaOptions = new Array("个旧市",532501,"开远市",532502,"蒙自市",532503,"弥勒市",532504,"屏边苗族自治县",532523,"建水县",532524,"石屏县",532525,"泸西县",532527,"元阳县",532528,"红河县",532529,"金平苗族瑶族傣族自治",532530,"绿春县",532531,"河口瑶族自治县",532532,"其它区",821155 );
 break;
case "532600" :
var areaOptions = new Array("文山市",532601,"砚山县",532622,"西畴县",532623,"麻栗坡县",532624,"马关县",532625,"丘北县",532626,"广南县",532627,"富宁县",532628,"其它区",821156 );
 break;
case "532800" :
var areaOptions = new Array("景洪市",532801,"勐海县",532822,"勐腊县",532823,"其它区",821157 );
 break;
case "532900" :
var areaOptions = new Array("大理市",532901,"漾濞彝族自治县",532922,"祥云县",532923,"宾川县",532924,"弥渡县",532925,"南涧彝族自治县",532926,"巍山彝族回族自治县",532927,"永平县",532928,"云龙县",532929,"洱源县",532930,"剑川县",532931,"鹤庆县",532932,"其它区",821158 );
 break;
case "533100" :
var areaOptions = new Array("瑞丽市",533102,"芒市",533103,"梁河县",533122,"盈江县",533123,"陇川县",533124,"其它区",821159 );
 break;
case "533300" :
var areaOptions = new Array("泸水县",533321,"福贡县",533323,"贡山独龙族怒族自治县",533324,"兰坪白族普米族自治县",533325,"其它区",821160 );
 break;
case "533400" :
var areaOptions = new Array("香格里拉市",533401,"德钦县",533422,"维西傈僳族自治县",533423,"其它区",821161 );
 break;
case "540100" :
var areaOptions = new Array("城关区",540102,"林周县",540121,"当雄县",540122,"尼木县",540123,"曲水县",540124,"堆龙德庆县",540125,"达孜县",540126,"墨竹工卡县",540127,"其它区",821162 );
 break;
case "540200" :
var areaOptions = new Array("桑珠孜区",540202,"南木林县",540221,"江孜县",540222,"定日县",540223,"萨迦县",540224,"拉孜县",540225,"昂仁县",540226,"谢通门县",540227,"白朗县",540228,"仁布县",540229,"康马县",540230,"定结县",540231,"仲巴县",540232,"亚东县",540233,"吉隆县",540234,"聂拉木县",540235,"萨嘎县",540236,"岗巴县",540237,"其它区",821163 );
 break;
case "540300" :
var areaOptions = new Array("卡若区",540302,"江达县",540321,"贡觉县",540322,"类乌齐县",540323,"丁青县",540324,"察雅县",540325,"八宿县",540326,"左贡县",540327,"芒康县",540328,"洛隆县",540329,"边坝县",540330,"其它区",821164 );
 break;
case "540400" :
var areaOptions = new Array("巴宜区",540402,"工布江达县",540421,"米林县",540422,"墨脱县",540423,"波密县",540424,"察隅县",540425,"朗县",540426,"其它区",821165 );
 break;
case "542200" :
var areaOptions = new Array("乃东县",542221,"扎囊县",542222,"贡嘎县",542223,"桑日县",542224,"琼结县",542225,"曲松县",542226,"措美县",542227,"洛扎县",542228,"加查县",542229,"隆子县",542231,"错那县",542232,"浪卡子县",542233,"其它区",821166 );
 break;
case "542400" :
var areaOptions = new Array("那曲县",542421,"嘉黎县",542422,"比如县",542423,"聂荣县",542424,"安多县",542425,"申扎县",542426,"索县",542427,"班戈县",542428,"巴青县",542429,"尼玛县",542430,"双湖县",542431,"其它区",821167 );
 break;
case "542500" :
var areaOptions = new Array("普兰县",542521,"札达县",542522,"噶尔县",542523,"日土县",542524,"革吉县",542525,"改则县",542526,"措勤县",542527,"其它区",821168 );
 break;
case "610100" :
var areaOptions = new Array("新城区",610102,"碑林区",610103,"莲湖区",610104,"灞桥区",610111,"未央区",610112,"雁塔区",610113,"阎良区",610114,"临潼区",610115,"长安区",610116,"高陵区",610117,"蓝田县",610122,"周至县",610124,"户县",610125,"其它区",821169 );
 break;
case "610200" :
var areaOptions = new Array("王益区",610202,"印台区",610203,"耀州区",610204,"宜君县",610222,"其它区",821170 );
 break;
case "610300" :
var areaOptions = new Array("渭滨区",610302,"金台区",610303,"陈仓区",610304,"凤翔县",610322,"岐山县",610323,"扶风县",610324,"眉县",610326,"陇县",610327,"千阳县",610328,"麟游县",610329,"凤县",610330,"太白县",610331,"其它区",821171 );
 break;
case "610400" :
var areaOptions = new Array("秦都区",610402,"杨陵区",610403,"渭城区",610404,"三原县",610422,"泾阳县",610423,"乾县",610424,"礼泉县",610425,"永寿县",610426,"彬县",610427,"长武县",610428,"旬邑县",610429,"淳化县",610430,"武功县",610431,"兴平市",610481,"其它区",821172 );
 break;
case "610500" :
var areaOptions = new Array("临渭区",610502,"华县",610521,"潼关县",610522,"大荔县",610523,"合阳县",610524,"澄城县",610525,"蒲城县",610526,"白水县",610527,"富平县",610528,"韩城市",610581,"华阴市",610582,"其它区",821173 );
 break;
case "610600" :
var areaOptions = new Array("宝塔区",610602,"延长县",610621,"延川县",610622,"子长县",610623,"安塞县",610624,"志丹县",610625,"吴起县",610626,"甘泉县",610627,"富县",610628,"洛川县",610629,"宜川县",610630,"黄龙县",610631,"黄陵县",610632,"其它区",821174 );
 break;
case "610700" :
var areaOptions = new Array("汉台区",610702,"南郑县",610721,"城固县",610722,"洋县",610723,"西乡县",610724,"勉县",610725,"宁强县",610726,"略阳县",610727,"镇巴县",610728,"留坝县",610729,"佛坪县",610730,"其它区",821175 );
 break;
case "610800" :
var areaOptions = new Array("榆阳区",610802,"神木县",610821,"府谷县",610822,"横山县",610823,"靖边县",610824,"定边县",610825,"绥德县",610826,"米脂县",610827,"佳县",610828,"吴堡县",610829,"清涧县",610830,"子洲县",610831,"其它区",821176 );
 break;
case "610900" :
var areaOptions = new Array("汉滨区",610902,"汉阴县",610921,"石泉县",610922,"宁陕县",610923,"紫阳县",610924,"岚皋县",610925,"平利县",610926,"镇坪县",610927,"旬阳县",610928,"白河县",610929,"其它区",821177 );
 break;
case "611000" :
var areaOptions = new Array("商州区",611002,"洛南县",611021,"丹凤县",611022,"商南县",611023,"山阳县",611024,"镇安县",611025,"柞水县",611026,"其它区",821178 );
 break;
case "620100" :
var areaOptions = new Array("城关区",620102,"七里河区",620103,"西固区",620104,"安宁区",620105,"红古区",620111,"永登县",620121,"皋兰县",620122,"榆中县",620123,"其它区",821179 );
 break;
case "620200" :
var areaOptions = new Array("新城镇",821180,"峪泉镇",821181,"文殊镇",821182,"雄关区",821183,"镜铁区",821184,"长城区",821185,"其它区",821186 );
 break;
case "620300" :
var areaOptions = new Array("金川区",620302,"永昌县",620321,"其它区",821187 );
 break;
case "620400" :
var areaOptions = new Array("白银区",620402,"平川区",620403,"靖远县",620421,"会宁县",620422,"景泰县",620423,"其它区",821188 );
 break;
case "620500" :
var areaOptions = new Array("秦州区",620502,"麦积区",620503,"清水县",620521,"秦安县",620522,"甘谷县",620523,"武山县",620524,"张家川回族自治县",620525,"其它区",821189 );
 break;
case "620600" :
var areaOptions = new Array("凉州区",620602,"民勤县",620621,"古浪县",620622,"天祝藏族自治县",620623,"其它区",821190 );
 break;
case "620700" :
var areaOptions = new Array("甘州区",620702,"肃南裕固族自治县",620721,"民乐县",620722,"临泽县",620723,"高台县",620724,"山丹县",620725,"其它区",821191 );
 break;
case "620800" :
var areaOptions = new Array("崆峒区",620802,"泾川县",620821,"灵台县",620822,"崇信县",620823,"华亭县",620824,"庄浪县",620825,"静宁县",620826,"其它区",821192 );
 break;
case "620900" :
var areaOptions = new Array("肃州区",620902,"金塔县",620921,"瓜州县",620922,"肃北蒙古族自治县",620923,"阿克塞哈萨克族自治县",620924,"玉门市",620981,"敦煌市",620982,"其它区",821193 );
 break;
case "621000" :
var areaOptions = new Array("西峰区",621002,"庆城县",621021,"环县",621022,"华池县",621023,"合水县",621024,"正宁县",621025,"宁县",621026,"镇原县",621027,"其它区",821194 );
 break;
case "621100" :
var areaOptions = new Array("安定区",621102,"通渭县",621121,"陇西县",621122,"渭源县",621123,"临洮县",621124,"漳县",621125,"岷县",621126,"其它区",821195 );
 break;
case "621200" :
var areaOptions = new Array("武都区",621202,"成县",621221,"文县",621222,"宕昌县",621223,"康县",621224,"西和县",621225,"礼县",621226,"徽县",621227,"两当县",621228,"其它区",821196 );
 break;
case "622900" :
var areaOptions = new Array("临夏市",622901,"临夏县",622921,"康乐县",622922,"永靖县",622923,"广河县",622924,"和政县",622925,"东乡族自治县",622926,"积石山保安族东乡族撒",622927,"其它区",821197 );
 break;
case "623000" :
var areaOptions = new Array("合作市",623001,"临潭县",623021,"卓尼县",623022,"舟曲县",623023,"迭部县",623024,"玛曲县",623025,"碌曲县",623026,"夏河县",623027,"其它区",821198 );
 break;
case "630100" :
var areaOptions = new Array("城东区",630102,"城中区",630103,"城西区",630104,"城北区",630105,"大通回族土族自治县",630121,"湟中县",630122,"湟源县",630123,"其它区",821199 );
 break;
case "630200" :
var areaOptions = new Array("乐都区",630202,"平安区",630203,"民和回族土族自治县",630222,"互助土族自治县",630223,"化隆回族自治县",630224,"循化撒拉族自治县",630225,"其它区",821200 );
 break;
case "632200" :
var areaOptions = new Array("门源回族自治县",632221,"祁连县",632222,"海晏县",632223,"刚察县",632224,"其它区",821201 );
 break;
case "632300" :
var areaOptions = new Array("同仁县",632321,"尖扎县",632322,"泽库县",632323,"河南蒙古族自治县",632324,"其它区",821202 );
 break;
case "632500" :
var areaOptions = new Array("共和县",632521,"同德县",632522,"贵德县",632523,"兴海县",632524,"贵南县",632525,"其它区",821203 );
 break;
case "632600" :
var areaOptions = new Array("玛沁县",632621,"班玛县",632622,"甘德县",632623,"达日县",632624,"久治县",632625,"玛多县",632626,"其它区",821204 );
 break;
case "632700" :
var areaOptions = new Array("玉树市",632701,"杂多县",632722,"称多县",632723,"治多县",632724,"囊谦县",632725,"曲麻莱县",632726,"其它区",821205 );
 break;
case "632800" :
var areaOptions = new Array("格尔木市",632801,"德令哈市",632802,"乌兰县",632821,"都兰县",632822,"天峻县",632823,"其它区",821206 );
 break;
case "640100" :
var areaOptions = new Array("兴庆区",640104,"西夏区",640105,"金凤区",640106,"永宁县",640121,"贺兰县",640122,"灵武市",640181,"其它区",821207 );
 break;
case "640200" :
var areaOptions = new Array("大武口区",640202,"惠农区",640205,"平罗县",640221,"其它区",821208 );
 break;
case "640300" :
var areaOptions = new Array("利通区",640302,"红寺堡区",640303,"盐池县",640323,"同心县",640324,"青铜峡市",640381,"其它区",821209 );
 break;
case "640400" :
var areaOptions = new Array("原州区",640402,"西吉县",640422,"隆德县",640423,"泾源县",640424,"彭阳县",640425,"其它区",821210 );
 break;
case "640500" :
var areaOptions = new Array("沙坡头区",640502,"中宁县",640521,"海原县",640522,"其它区",821211 );
 break;
case "650100" :
var areaOptions = new Array("天山区",650102,"沙依巴克区",650103,"新市区",650104,"水磨沟区",650105,"头屯河区",650106,"达坂城区",650107,"米东区",650109,"乌鲁木齐县",650121,"其它区",821216,"东山区",821217 );
 break;
case "650200" :
var areaOptions = new Array("独山子区",650202,"克拉玛依区",650203,"白碱滩区",650204,"乌尔禾区",650205,"其它区",821218 );
 break;
case "650400" :
var areaOptions = new Array("高昌区",650402,"鄯善县",650421,"托克逊县",650422,"其它区",821219 );
 break;
case "652200" :
var areaOptions = new Array("哈密市",652201,"巴里坤哈萨克自治县",652222,"伊吾县",652223,"其它区",821220 );
 break;
case "652300" :
var areaOptions = new Array("昌吉市",652301,"阜康市",652302,"呼图壁县",652323,"玛纳斯县",652324,"奇台县",652325,"吉木萨尔县",652327,"木垒哈萨克自治县",652328,"其它区",821221,"米泉市",821222 );
 break;
case "652700" :
var areaOptions = new Array("博乐市",652701,"阿拉山口市",652702,"精河县",652722,"温泉县",652723,"其它区",821223 );
 break;
case "652800" :
var areaOptions = new Array("库尔勒市",652801,"轮台县",652822,"尉犁县",652823,"若羌县",652824,"且末县",652825,"焉耆回族自治县",652826,"和静县",652827,"和硕县",652828,"博湖县",652829,"其它区",821224 );
 break;
case "652900" :
var areaOptions = new Array("阿克苏市",652901,"温宿县",652922,"库车县",652923,"沙雅县",652924,"新和县",652925,"拜城县",652926,"乌什县",652927,"阿瓦提县",652928,"柯坪县",652929,"其它区",821225 );
 break;
case "653000" :
var areaOptions = new Array("阿图什市",653001,"阿克陶县",653022,"阿合奇县",653023,"乌恰县",653024,"其它区",821226 );
 break;
case "653100" :
var areaOptions = new Array("喀什市",653101,"疏附县",653121,"疏勒县",653122,"英吉沙县",653123,"泽普县",653124,"莎车县",653125,"叶城县",653126,"麦盖提县",653127,"岳普湖县",653128,"伽师县",653129,"巴楚县",653130,"塔什库尔干塔吉克自治",653131,"其它区",821227 );
 break;
case "653200" :
var areaOptions = new Array("和田市",653201,"和田县",653221,"墨玉县",653222,"皮山县",653223,"洛浦县",653224,"策勒县",653225,"于田县",653226,"民丰县",653227,"其它区",821228 );
 break;
case "654000" :
var areaOptions = new Array("伊宁市",654002,"奎屯市",654003,"霍尔果斯市",654004,"伊宁县",654021,"察布查尔锡伯自治县",654022,"霍城县",654023,"巩留县",654024,"新源县",654025,"昭苏县",654026,"特克斯县",654027,"尼勒克县",654028,"其它区",821229 );
 break;
case "654200" :
var areaOptions = new Array("塔城市",654201,"乌苏市",654202,"额敏县",654221,"沙湾县",654223,"托里县",654224,"裕民县",654225,"和布克赛尔蒙古自治县",654226,"其它区",821230 );
 break;
case "654300" :
var areaOptions = new Array("阿勒泰市",654301,"布尔津县",654321,"富蕴县",654322,"福海县",654323,"哈巴河县",654324,"青河县",654325,"吉木乃县",654326,"其它区",821231 );
 break;
case "659000" :
var areaOptions = new Array("双河市",659007,"可克达拉市",659008 );
 break;
case "821212" :
var areaOptions = new Array("新城街道",821232,"向阳街道",821233,"红山街道",821234,"老街街道",821235,"东城街道",821236,"北泉镇",821237,"石河子乡",821238,"兵团一五二团",821239,"其它区",821240 );
 break;
case "821213" :
var areaOptions = new Array("金银川路街道",821241,"幸福路街道",821242,"青松路街道",821243,"南口街道",821244,"托喀依乡",821245,"工业园区",821246,"兵团七团",821247,"兵团八团",821248,"兵团十团",821249,"兵团十一团",821250,"兵团十二团",821251,"兵团十三团",821252,"兵团十四团",821253,"兵团十六团",821254,"兵团第一师水利工程处",821255,"兵团第一师塔里木灌区",821256,"阿拉尔农场",821257,"兵团第一师幸福农场",821258,"中心监狱",821259,"其它区",821260 );
 break;
case "821214" :
var areaOptions = new Array("齐干却勒街道",821261,"前海街道",821262,"永安坝街道",821263,"兵团四十四团",821264,"兵团四十九团",821265,"兵团五十团",821266,"兵团五十一团",821267,"兵团五十三团",821268,"兵团喀拉拜勒镇",821269,"兵团图木舒克市永安坝",821270,"其它区",821271 );
 break;
case "821215" :
var areaOptions = new Array("军垦路街道",821272,"青湖路街道",821273,"人民路街道",821274,"兵团一零一团",821275,"兵团一零二团",821276,"兵团一零三团",821277,"其它区",821278 );
 break;
        default:
            var areaOptions = new Array("");
            break;
        }

        SelA.options.length = 0;
        for(var i = 0; i < areaOptions.length/2; i++) {
            SelA.options[i]=new Option(areaOptions[i*2],areaOptions[i*2+1]);
            if (SelA.options[i].value==DefA) {
                SelA.selectedIndex = i;
            }
        }
         $(".rule-single-select").ruleSingleSelect();//绑定需要浮动的表头
    }
          if (DefP) {
        if(SelP.fireEvent) {
        SelP.fireEvent('onchange');
        }else {
            SelP.onchange();
        }
    }

    if (DefC) {
        if(SelC.fireEvent) {
        SelC.fireEvent('onchange');
        }else {
            SelC.onchange();
        }
    }

}
